[
    {
        "index": 1,
        "description": "Senior Firmware Engineer (Onsite) Mayfield Heights, Ohio Only Full time JOB DETAIL: 1. Good experience of working in C and C++ in an embedded work environment or software application 2. 5+ years of software engineering experience with demonstrated professional development in software design and development 3. Ability to understand and apply knowledge of object-oriented analysis, design, and programming techniques, especially in C++ 4. Ability to direct the day-to-day technical activities of a small team of engineers 5. Previous experience working with real-time embedded development environments and ARM/Intel architecture Desired qualification: 1. Experience developing software to meet safety and security standards such as IEC 61508 or IEC 62443 2. Experience developing software using a scripting language such as Python 3. Knowledge of communication protocols and technologies such as SPI, UART, I2C, Ethernet, USB, or PCI Express 4. Experience using compilers and toolchains targeting ARM and Intel processors. 5. Ability to read traces, use an oscilloscope, review board schematics 6. Experience developing device drivers or other similar low-level embedded software 7. Knowledge of modern ARM and Intel architectures 8. Experience working with embedded Hypervisors and developing embedded software in a variety of software environments such as bare metal, embedded RTOS, or Linux 9. Knowledge of basic cryptography principles 10. Advanced coursework or degree related to software engineering, embedded systems, operating systems, or computer architecture sri nath"
    },
    {
        "index": 2,
        "description": "Imperial Electric, A Nidec Company, is a custom manufacturer of special application AC and DC motor systems for the elevator/escalator, commercial floor care, and other markets. With more than 100 years of industry experience, Imperial Electric offers a complete line of products including permanent magnet motors, gear motors, AC and DC elevator motors, AC induction motors, generator sets, wheel drives, gear boxes, and gearing. Imperial Electric is a Nidec Company. Learn more about Imperial Electric and Nidec at www.imperialelectric.com and www.nidec.com Sales Account Manager Sales Position for field sales, sales development, and working with new and existing customers in the Elevator Industry. Arrange and hold customer meetings, quote follow ups of written quotes for AC/DC Motors, Gearless Machines and Hydraulic motors in the Elevator Industry. Determination of products is required to meet the customer requirements especially for Modernization Projects. Customer account responsibility, some travel to customer locations and several industry trade shows per year. Excellent verbal and written technical skills required. Duties: Consult with external customers including specifying, consulting engineers and elevator contractors, interpreting customer requirements and providing product application assistance via phone and e-mail. Prepare and follow up on quotations from established pricing strategies. Provide timely and accurate information to customers on the proper application and installation of Imperial Electric Machines and Motors Position reports to the Vice President of Sales and Marketing Requirements: Bachelor’s degree, preferably in Engineering or Business, or equivalent work experience preferably in Electrical or Mechanical Engineering, or recent college graduates with an aptitude for sales. Excellent oral, technical writing and presentation skills General computer software skills including MS Office, AutoCAD, and Salesforce Ability to plan, organize, and manage sales contacts and quotes. Some travel is required Elevator Industry a plus Training will be provided."
    },
    {
        "index": 3,
        "description": "PointClickCare is a leading North American healthcare technology platform enabling meaningful care collaboration and real‐time patient insights. For over 20 years, the company has been focused on realizing its vision: to help create a world in which providers and plans can confidently deliver frictionless care. Since its inception, PointClickCare has grown exponentially, with over 2,200 employees working to impact millions across North America. Recognized by Forbes as one of the top 100 private cloud companies and acknowledged by Waterstone Human Capital as Canada’s Most Admired Corporate Cultures, PointClickCare leads the way in creating cloud-based healthcare software. At PointClickCare, we offer a wealth of opportunities and a vibrant culture that empowers our employees. Our dynamic environment is the perfect place to advance your career while engaging in meaningful work alongside incredible colleagues. Here, you’ll discover a space where your talents can thrive, your career can grow, and your work will have a lasting impact on healthcare across North America. We believe that work becomes profoundly fulfilling when driven by a higher purpose. Join us and be part of a team that is making a real impact. Job title: Senior Software Engineer What your day-to-day will look like: · Identify, prioritize and execute tasks in the software development life cycle · Work with business to iterate over software requirements · Develop tools and applications by producing clean, efficient code · Automate tasks through appropriate tools and scripting · Analyze and debug systems · Perform validation and verification testing in a test-driven manner · Review the work of others, and invite others to review your work · Collaborate with internal teams and vendors to fix and improve products · Ensure software is up-to-date with latest technologies What qualifications we’re looking for: · Experience writing clean code that performs well at scale using languages such as Java/Kotlin/C#/Go · Experience with automated testing frameworks (e.g. Selenium, Cypress, RestAssured) · In-depth knowledge of relational databases (e.g. Microsoft SQL Server, MySQL) · Solid experience writing RESTful API endpoints · Absolutely love TDD and have working knowledge of it · Experience with UI development and frameworks (e.g. Vue.js, React, Angular) · Proficient in GIT · Experience using system and performance monitoring tools (e.g. New Relic, DataDog) · Excellent organization, critical-thinking and personal leadership skills · Self-starter with the ability to deliver with minimal supervision · Being okay with the uncomfortable feeling that comes from learning new things · Team player · Analytical mind with problem-solving aptitude · Proven experience as a great Engineer · BSc/BA in Computer Science or a related degree Bonus points for: · Experience with Spring Boot · Nice to have React, Selenium automation and cloud experience · Experience with Docker, Kubernetes and Istio · Experience with Ansible · Experience with Jenkins CI/CD pipeline · Linux and IP networking knowledge · Experience with AWS/Azure cloud services or equivalent · Experience with SAML, OAuth and OpenID Connect · Experience working on a SaaS product · Experience with Service Oriented Architecture · Knowledge of scripting languages such as Python, Bash or Groovy · On-call experience with production grade systems · Has mentored others in a professional setting #LI-Hybrid #LI-Aj1 PointClickCare Benefits & Perks: Benefits starting from Day 1! Retirement Plan Matching Flexible Paid Time Off Wellness Support Programs and Resources Parental & Caregiver Leaves Fertility & Adoption Support Continuous Development Support Program Employee Assistance Program Allyship and Inclusion Communities Employee Recognition … and more! It is the policy of PointClickCare to ensure equal employment opportunity without discrimination or harassment on the basis of race, religion, national origin, status, age, sex, sexual orientation, gender identity or expression, marital or domestic/civil partnership status, disability, veteran status, genetic information, or any other basis protected by law. PointClickCare welcomes and encourages applications from people with disabilities. Accommodations are available upon request for candidates taking part in all aspects of the selection process. Please contact ***********@pointclickcare.com should you require any accommodations. When you apply for a position, your information is processed and stored with Lever, in accordance with Lever’s Privacy Policy. We use this information to evaluate your candidacy for the posted position. We also store this information, and may use it in relation to future positions to which you apply, or which we believe may be relevant to you given your background. When we have no ongoing legitimate business need to process your information, we will either delete or anonymize it. If you have any questions about how PointClickCare uses or processes your information, or if you would like to ask to access, correct, or delete your information, please contact PointClickCare’s human resources team: ***********@pointclickcare.com PointClickCare is committed to Information Security. By applying to this position, if hired, you commit to following our information security policies and procedures and making every effort to secure confidential and/or sensitive information."
    },
    {
        "index": 4,
        "description": "Overview As a Senior Software Engineer, you will play a crucial role in developing both front-end and back-end components of our applications. You will collaborate with cross-functional teams to design, develop, and maintain scalable software solutions. Additionally, you will be looked to as a leader within the team to set a standard of excellence for more junior team members. Responsibilities Design, develop, and maintain high-quality web applications using Angular for front-end and .NET for back-end API development. Collaborate with product managers, designers, and other engineers to define and implement innovative solutions. Write clean, maintainable, and efficient code, following best practices and design patterns. Conduct code reviews and mentor junior developers to promote knowledge sharing and professional growth. Troubleshoot, debug, and optimize applications for performance and scalability. Stay up-to-date with emerging technologies and industry trends, and apply them to improve our development processes. Qualifications Minimum of 5 years of professional software development experience. Strong proficiency in Angular and .NET frameworks. Experience in developing RESTful APIs and microservices architecture. Solid understanding of front-end technologies (HTML, CSS, JavaScript) and back-end technologies (C#, SQL Server). Familiarity with version control systems (e.g., Git) and CI/CD pipelines. Experience and strong commitment to writing unit tests. Excellent problem-solving skills and attention to detail. Familiarity with Agile/Scrum methodologies. Strong communication skills and ability to work effectively in a team-oriented environment. Nice to Have Qualifications: Experience with cloud services (e.g., Azure). Experience with Azure DevOps build and release pipelines. Knowledge of containerization technologies (e.g., Docker, Kubernetes). Experience with tracing and logging solutions (e.g. Splunk, Jaeger) #LI-NS1 #LI-HYBRID #AmTrust This job description is designed to provide a general overview of the requirements of the job and does not entail a comprehensive listing of all activities, duties, or responsibilities that will be required in this position. AmTrust has the right to revise this job description at any time. What We Offer AmTrust Financial Services offers a competitive compensation package and excellent career advancement opportunities. Our benefits include: Medical & Dental Plans, Life Insurance, including eligible spouses & children, Health Care Flexible Spending, Dependent Care, 401k Savings Plans, Paid Time Off. AmTrust strives to create a diverse and inclusive culture where thoughts and ideas of all employees are appreciated and respected. This concept encompasses but is not limited to human differences with regard to race, ethnicity, gender, sexual orientation, culture, religion or disabilities. AmTrust values excellence and recognizes that by embracing the diverse backgrounds, skills, and perspectives of its workforce, it will sustain a competitive advantage and remain an employer of choice. Diversity is a business imperative, enabling us to attract, retain and develop the best talent available. We see diversity as more than just policies and practices. It is an integral part of who we are as a company, how we operate and how we see our future. Connect With Us! Not ready to apply? Connect with us for general consideration."
    },
    {
        "index": 5,
        "description": "From the day we opened our doors in 1971, MRI Software has built flexible, game-changing real estate software solutions to improve people’s lives. The only way to carry out that mission is to hire the absolute best employees on earth. People like you. Work hard, play hard. Always. Our relentless commitment to client success, our employee resource groups and our promise to empower our teams to reach their full potential are a few examples of what makes MRI Software special. And we’re passionately dedicated to creating a work environment that you look forward to every single day. That’s why we invest heavily in our employee engagement, so you enjoy the tech industry’s best perks. Together with the whole Pride, (lion roar for \"family\") employees, customers, and partners, we’re on a mission to break new ground and lead the real estate industry into a digital-first future. We understand the need to provide a flexible working environment partnered with team collaboration and socialization. Therefore, we operate a hybrid working model with 3 days in-office and 2 days remotely. This role is based at our HQ in Solon, Ohio. Applicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time. The Role: We are seeking a highly skilled Senior .NET Developer to join our team. The ideal candidate will have 3+ years of experience developing web applications and REST APIs using .NET Core and C#. This role requires expertise in both backend and frontend technologies, with additional knowledge of architectural patterns and cloud solutions being a plus. Key Responsibilities: Develop, maintain, and optimize web applications and REST APIs using .NET Core (C#). Work with modern JavaScript and Microsoft frameworks (TypeScript preferred) such as React, Next.js, and Blazor to build dynamic front-end applications. Design and implement efficient database solutions with Microsoft SQL Server and PostgreSQL (a plus). Apply best practices in architectural patterns and contribute to system design. Collaborate with cross-functional teams to develop scalable and high-performing applications. Utilize Git for version control and CI/CD processes. Qualifications & Skills: 3+ years of experience developing web applications and REST APIs using .NET Core (C# preferred). Strong front-end development skills using HTML5, CSS, and modern JavaScript frameworks (TypeScript, Angular, React, Next.js). Experience with Microsoft SQL Server and PostgreSQL (a plus). Knowledge of architectural patterns and Azure cloud services (a plus). Proficiency in version control systems (Git, Azure DevOps, TFS, etc...). Strong problem-solving skills and ability to work in a collaborative team environment. Preferred Qualifications: Experience with Blazor. Familiarity with microservices architecture. Experience in deploying applications on Azure cloud. If you are a motivated developer passionate about building high-quality web applications and APIs, we’d love to hear from you! We’re obsessed with making this the best job you’ve ever had! We want our teams to love working here, so we’ve created some incredible perks for you to enjoy: Join our employee-led groups to maximize your experience at work such as our Diversity, Equity and Inclusion committee, employee resource groups such as Women and Allies, and our Pride Event Group Enjoy peace of mind over yours and your family’s health with our medical coverage options and HSA benefit Invest in our competitive 401k plan and help set you up for your future Big on family? So are we! We understand family is important and being able to spend quality time with your family is a wonderful experience. Our Parental Leave Program is designed to give you the opportunity to spend even more time with your new arrival(s) Enjoy a fantastic work-life balance with 20 days PTO plus observed Holidays, plus 16 hours of ‘Flexi’ time a year Further your professional development and growth with our generous Tuition Reimbursement offerings Enjoy the flexibility of working from anywhere in the world for two weeks out of the year At MRI, our company culture is more than a talking point – it’s what makes us shine! We value your hard work and encourage you to be your whole self while you do it. Passion, integrity, and inclusion mixed with a healthy dose of fun is what makes us the best fit for your next career move! MRI continues to strive to amaze as a global industry leader in real estate software. Whether you are joining as a new pride member or bringing your expertise back, your talent is important to maintaining MRI’s high client experience standard and continuing our growth in the PropTech space. Amazing growth takes amazing employees. Are you up to the challenge? We are not accepting unsolicited resumes from agencies and/or search firms for this job posting. Environmental Conditions This person will work predominantly in an office type environment. Physical Demands While performing the duties of this job, the employee is regularly required to sit up to 8 or more hours a day. The employee is frequently required to see, hear and speak. The employee may be required to work at a computer work station for more than 5 hours a day. Mental Demands Reading, studying focused listening, auditing, inspecting, proofreading, and evaluating required. Ability to give, receive, and analyze information and prepare written materials. Ability to communicate effectively (verbal and written); interpret policy, procedures, and data. MRI Software is an Equal Opportunity Employer. Regardless of your race, color, religion, sex, national origin, sexual orientation, gender identity, disability, age, veteran status, you are welcome here."
    },
    {
        "index": 6,
        "description": "Position Overview At PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. We work together each day to foster an inclusive workplace culture where all of our employees feel respected, valued and have an opportunity to contribute to the company’s success. As a Lead Software Engineer within PNC's Technology organization, you will be remotely based in the Cleveland, OH, Pittsburgh, PA, Dallas, TX, or Birmingham, AL markets. This is a remote position. Work may be performed from a quiet, confidential space in a home location, approved by PNC. This position may not be available in all geographic locations. As a Lead Software Engineer you will be working with multiple teams in support of existing and developing new APIs to support the business. Some of your job responsibilities will include, but are not limited to: *Base Image/Micron Updates *JDK Updates *Enhancement Requests *Coordinate testing with BSA/testing *Train and support other groups on code promotion Must be efficient in: *Java *Open Shift *Bitbucket *Jenkins *IntelliJ IDE PNC will not provide sponsorship for employment visas or participate in STEM OPT for this position. Job Description + Creates and leads the technical design and development of software solutions. + Proposes & designs software solutions to address complex business needs. Prepares technical and procedural documentation required. + Facilitates complex problem resolution. + Provides technical guidance and support to colleagues. Reviews coding, testing, and documentation of software. + Applies modern principles, methodologies and tools to advance business initiatives and capabilities. PNC Employees take pride in our reputation and to continue building upon that we expect our employees to be: + Customer Focused - Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions. + Managing Risk - Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework. Qualifications Successful candidates must demonstrate appropriate knowledge, skills, and abilities for a role. Listed below are skills, competencies, work experience, education, and required certifications/licensures needed to be successful in this position. Preferred Skills Application Development, Business Management, Customer Solutions, Design, Group Problem Solving, Process Improvements, Release Management, Software Solutions, User Experience (UX) Design Competencies Application Delivery Process, Application Design, Architecture, Application Development Tools, Application Testing, Packaged Application Integration, System Development Life Cycle, Technical Troubleshooting Work Experience Roles at this level typically require a university / college degree, with 3+ years of relevant / direct industry experience. Certifications are often desired. In lieu of a degree, a comparable combination of education, job specific certification(s), and experience (including military service) may be considered. Education Bachelors Certifications No Required Certification(s) Licenses No Required License(s) Benefits PNC offers a comprehensive range of benefits to help meet your needs now and in the future. Depending on your eligibility, options for full-time employees include: medical/prescription drug coverage (with a Health Savings Account feature), dental and vision options; employee and spouse/child life insurance; short and long-term disability protection; 401(k) with PNC match, pension and stock purchase plans; dependent care reimbursement account; back-up child/elder care; adoption, surrogacy, and doula reimbursement; educational assistance, including select programs fully paid; a robust wellness program with financial incentives. In addition, PNC generally provides the following paid time off, depending on your eligibility: maternity and/or parental leave; up to 11 paid holidays each year; 8 occasional absence days each year, unless otherwise required by law; between 15 to 25 vacation days each year, depending on career level; and years of service. To learn more about these and other programs, including benefits for full time and part-time employees, visit Your PNC Total Rewards (http://yourpnctotalrewards.com) . Disability Accommodations Statement If an accommodation is required to participate in the application process, please contact us via email at ***************@pnc.com . Please include “accommodation request” in the subject line title and be sure to include your name, the job ID, and your preferred method of contact in the body of the email. Emails not related to accommodation requests will not receive responses. Applicants may also call 877-968-7762 and say \"Workday\" for accommodation assistance. All information provided will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. At PNC we foster an inclusive and accessible workplace. We provide reasonable accommodations to employment applicants and qualified individuals with a disability who need an accommodation to perform the essential functions of their positions. Equal Employment Opportunity (EEO) PNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law. This position is subject to the requirements of Section 19 of the Federal Deposit Insurance Act (FDIA) and, for any registered role, the Secure and Fair Enforcement for Mortgage Licensing Act of 2008 (SAFE Act) and/or the Financial Industry Regulatory Authority (FINRA), which prohibit the hiring of individuals with certain criminal history. California Residents Refer to the California Consumer Privacy Act Privacy Notice (https://content.pncmc.com/live/pnc/aboutus/HR/Onboarding/PNC_CCPA_Privacy_Disclosure_Employee.pdf) to gain understanding of how PNC may use or disclose your personal information in our hiring practices."
    },
    {
        "index": 7,
        "description": "Position Overview At PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. We work together each day to foster an inclusive workplace culture where all of our employees feel respected, valued and have an opportunity to contribute to the company's success. As a Software Engineer Lead within PNC's Technology organization, you will be based in Pittsburgh, PA, Cleveland, OH, Birmingham, AL, or Dallas, TX. This position is primarily based in a PNC location. Responsibilities require time in the office or in the field on a regular basis. Some responsibilities may be performed remotely, at manager's discretion. Job Description Creates and leads the technical design and development of software solutions. Proposes & designs software solutions to address complex business needs. Prepares technical and procedural documentation required. Facilitates complex problem resolution. Provides technical guidance and support to colleagues. Reviews coding, testing, and documentation of software. Applies modern principles, methodologies and tools to advance business initiatives and capabilities. PNC Employees take pride in our reputation and to continue building upon that we expect our employees to be: Customer Focused - Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions. Managing Risk - Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework. Qualifications Successful candidates must demonstrate appropriate knowledge, skills, and abilities for a role. Listed below are skills, competencies, work experience, education, and required certifications/licensures needed to be successful in this position. Preferred Skills Application Development, Business Management, Customer Solutions, Design, Group Problem Solving, Process Improvements, Release Management, Software Solutions, User Experience (UX) Design Competencies Application Delivery Process, Application Design, Architecture, Application Development Tools, Application Testing, Packaged Application Integration, System Development Life Cycle, Technical Troubleshooting Work Experience Roles at this level typically require a university / college degree, with 3+ years of relevant / direct industry experience. Certifications are often desired. In lieu of a degree, a comparable combination of education, job specific certification(s), and experience (including military service) may be considered. Education Bachelors Certifications No Required Certification(s) Licenses No Required License(s) Benefits PNC offers a comprehensive range of benefits to help meet your needs now and in the future. Depending on your eligibility, options for full-time employees include: medical/prescription drug coverage (with a Health Savings Account feature), dental and vision options; employee and spouse/child life insurance; short and long-term disability protection; 401(k) with PNC match, pension and stock purchase plans; dependent care reimbursement account; back-up child/elder care; adoption, surrogacy, and doula reimbursement; educational assistance, including select programs fully paid; a robust wellness program with financial incentives. In addition, PNC generally provides the following paid time off, depending on your eligibility: maternity and/or parental leave; up to 11 paid holidays each year; 8 occasional absence days each year, unless otherwise required by law; between 15 to 25 vacation days each year, depending on career level; and years of service. To learn more about these and other programs, including benefits for full time and part-time employees, visit Your PNC Total Rewards (http://yourpnctotalrewards.com) . Disability Accommodations Statement If an accommodation is required to participate in the application process, please contact us via email at ***************@pnc.com . Please include \"accommodation request\" in the subject line title and be sure to include your name, the job ID, and your preferred method of contact in the body of the email. Emails not related to accommodation requests will not receive responses. Applicants may also call 877-968-7762 and say \"Workday\" for accommodation assistance. All information provided will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. At PNC we foster an inclusive and accessible workplace. We provide reasonable accommodations to employment applicants and qualified individuals with a disability who need an accommodation to perform the essential functions of their positions. Equal Employment Opportunity (EEO) PNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law. This position is subject to the requirements of Section 19 of the Federal Deposit Insurance Act (FDIA) and, for any registered role, the Secure and Fair Enforcement for Mortgage Licensing Act of 2008 (SAFE Act) and/or the Financial Industry Regulatory Authority (FINRA), which prohibit the hiring of individuals with certain criminal history. California Residents Refer to the California Consumer Privacy Act Privacy Notice (https://content.pncmc.com/live/pnc/aboutus/HR/Onboarding/PNC\\CCPA\\Privacy\\Disclosure\\Employee.pdf) to gain understanding of how PNC may use or disclose your personal information in our hiring practices."
    },
    {
        "index": 8,
        "description": "Position Overview At PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. We work together each day to foster an inclusive workplace culture where all of our employees feel respected, valued and have an opportunity to contribute to the company's success. As an Software Engineer, Sr, this position will be based in a Technology Hub location (Pittsburgh, PA, Cleveland, OH, Birmingham, AL, Dallas, TX, Columbus, OH) Weekly time in the office is needed. PNC will not provide sponsorship for employment visas or participate in STEM OPT for this position Required skills: 3+ Years of Experience as a Full Stack Engineer • Strong hands-on Software Development experience. • Front end - React, Vue.js, Angular, Node.js, HTML, CSS, and JavaScript frameworks/libraries. • Middleware - Python, Java, C# • Databases - MongoDB, Microsoft SQL, No SQL • CI/CD - Ephemeral Jenkins, DDP Jenkins, Bitbucket, Atlassian Suite, Docker • Proven working experience in a team using collaboration tools like Git, Jira, etc. • Material UI or similar component library. • Unit and integration testing experience. • Analyzing user requirements to inform application design. • Write well-designed, testable, efficient code. • Contribute to all phases of the development lifecycle. • Participating in Agile development processes. Job Description Provides detailed technical design and development of software solutions using existing and emerging technology platforms. Proposes & designs software solutions to address complex business needs. Writes code, tests and deploys software. Prepares technical and procedural documentation required for software. Maintains and debugs software. PNC Employees take pride in our reputation and to continue building upon that we expect our employees to be: Customer Focused - Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions. Managing Risk - Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework. Qualifications Successful candidates must demonstrate appropriate knowledge, skills, and abilities for a role. Listed below are skills, competencies, work experience, education, and required certifications/licensures needed to be successful in this position. Preferred Skills Application Development, Business Management, Customer Solutions, Design, Group Problem Solving, Process Improvements, Release Management, Software Solutions, User Experience (UX) Design Competencies Application Delivery Process, Application Design, Architecture, Application Development Tools, Application Testing, Packaged Application Integration, System Development Life Cycle, Technical Troubleshooting, Technical Writing/Documentation Work Experience Roles at this level typically require a university / college degree, with 3+ years of relevant / direct industry experience. Certifications are often desired. In lieu of a degree, a comparable combination of education, job specific certification(s), and experience (including military service) may be considered. Education Bachelors Certifications No Required Certification(s) Licenses Candidates being considered for this position will be subject to additional background checks as established by the specific government client contract. Benefits PNC offers a comprehensive range of benefits to help meet your needs now and in the future. Depending on your eligibility, options for full-time employees include: medical/prescription drug coverage (with a Health Savings Account feature), dental and vision options; employee and spouse/child life insurance; short and long-term disability protection; 401(k) with PNC match, pension and stock purchase plans; dependent care reimbursement account; back-up child/elder care; adoption, surrogacy, and doula reimbursement; educational assistance, including select programs fully paid; a robust wellness program with financial incentives. In addition, PNC generally provides the following paid time off, depending on your eligibility: maternity and/or parental leave; up to 11 paid holidays each year; 8 occasional absence days each year, unless otherwise required by law; between 15 to 25 vacation days each year, depending on career level; and years of service. To learn more about these and other programs, including benefits for full time and part-time employees, visit Your PNC Total Rewards. Disability Accommodations Statement If an accommodation is required to participate in the application process, please contact us via email at ***************@pnc.com. Please include \"accommodation request\" in the subject line title and be sure to include your name, the job ID, and your preferred method of contact in the body of the email. Emails not related to accommodation requests will not receive responses. Applicants may also call 877-968-7762 and say \"Workday\" for accommodation assistance. All information provided will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. At PNC we foster an inclusive and accessible workplace. We provide reasonable accommodations to employment applicants and qualified individuals with a disability who need an accommodation to perform the essential functions of their positions. Equal Employment Opportunity (EEO) PNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law. This position is subject to the requirements of Section 19 of the Federal Deposit Insurance Act (FDIA) and, for any registered role, the Secure and Fair Enforcement for Mortgage Licensing Act of 2008 (SAFE Act) and/or the Financial Industry Regulatory Authority (FINRA), which prohibit the hiring of individuals with certain criminal history. California Residents Refer to the California Consumer Privacy Act Privacy Notice to gain understanding of how PNC may use or disclose your personal information in our hiring practices."
    },
    {
        "index": 9,
        "description": "ABOUT THE ROLE: The Senior Data Engineer is responsible for designing, building, and maintaining the systems and infrastructure that enable organizations to collect, store, process, and analyze large volumes of data. This role involves collaborating closely with data scientists, analysts, QA engineers, business process / functional SMEs, and other stakeholders to ensure that data is accessible, reliable, and secure. They are responsible for tasks such as data ingestion, data transformation, data integration, and data pipeline development. Senior Data Engineers also play a crucial part in data governance, ensuring that data is compliant with regulations and policies. This role also includes all aspects of software development and deployment of IT Operations to shorten delivery and time to market for data products and data pipelines and data warehousing. Overall, the incumbent helps organizations leverage their data to gain meaningful insights and make informed decisions. Here, we believe there’s not one path to success, we believe in careers that grow with you. Whoever you are or wherever you come from in the world, there’s a place for you at Sherwin-Williams. We provide you with the opportunity to explore your curiosity and drive us forward. Sherwin-Williams values the unique talents and abilities from all backgrounds and characteristics. All qualified individuals are encouraged to apply, including individuals with disabilities and Protected Veterans. We’ll give you the space to share your strengths and we want you show us what you can do. You can innovate, grow and discover in a place where you can thrive and Let Your Colors Show! At Sherwin-Williams, part of our mission is to help our employees and their families live healthier, save smarter and feel better. This starts with a wide range of world-class benefits designed for you. From retirement to health care, from total well-being to your daily commute—it matters to us. A general description of benefits offered can be found at http://www.myswbenefits.com/. Click on “Candidates” to view benefit offerings that you may be eligible for if you are hired as a Sherwin-Williams employee. Compensation decisions are dependent on the facts and circumstances of each position, which will impact where actual compensation may fall within the stated wage range. The wage range listed for this role takes into account the wide range of non-discriminatory factors considered in making compensation decisions including geographic location; skill sets; experience and training; licensure and certifications; and other business and organizational needs. The wage range, other compensation, and benefits information listed is accurate as of the date of this posting. The Company reserves the right to modify this information at any time, with or without notice, subject to applicable law. Qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable federal, state, and local laws including with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act where applicable. Sherwin-Williams is proud to be an Equal Employment Opportunity/Affirmative Action employer committed to an inclusive and diverse workplace. All qualified candidates will receive consideration for employment and will not be discriminated against based on race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age, pregnancy, genetic information, creed, marital status or any other consideration prohibited by law or by contract. As a VEVRAA Federal Contractor, Sherwin-Williams requests state and local employment services delivery systems to provide priority referral of Protected Veterans. Please be aware, Sherwin-Williams recruiting team members will never request a candidate to provide a payment, ask for financial information, or sensitive personal information like national identification numbers, date of birth, or bank account numbers during the application process. WHAT THE ROLE WILL DO: Partner with a team of data engineers, providing technical guidance, mentorship, and support Act as a technical point of contact for clients and stakeholders, providing updates and addressing any data related technical inquiries or concerns Design, develop, and maintain efficient and robust data pipelines, ETL processes, and data workflows Develop and maintain data models and schema designs to support data storage and retrieval needs Optimize data storage, processing, and retrieval mechanisms for performance and scalability Provide technical leadership and guidance in the selection and implementation of data engineering tools and technologies Identify and implement best practices and standards for data engineering processes and tools Stay up-to-date with emerging technologies and trends in data engineering, evaluating their potential impact on our data infrastructure Collaborate with cross-functional teams to integrate data sources and enable seamless data flow across systems and with data scientists, analysts, and stakeholders to understand data requirements and develop scalable data solutions Implement and maintain data governance and security measures to protect sensitive information and to ensure data quality and integrity by implementing effective data validation and cleansing techniques This position is not eligible for sponsorship for work authorization now or in the future, including conversion to H1-B visa. This position has a hybrid work schedule with three days in the office and the option for working remotely two days. Job duties include contact with other employees and access confidential and proprietary information and/or other items of value, and such access may be supervised or unsupervised. The Company therefore has determined that a review of criminal history is necessary to protect the business and its operations and reputation and is necessary to protect the safety of the Company’s staff, employees, and business relationships. Travel: 5% WHAT THE INCUMBENT WILL NEED: Education Required Bachelor’s degree in Computer Science, Computer Engineering, or Information Technology or in lieu of a degree, at least 7 years of experience in data engineering. Preferred Experience with data engineering tools, experience with ETL/ELT tools like IDMC, and programming languages like Python and SQL, working knowledge of Jira for task tracking and deep understanding of data architecture principles, experience with cloud technologies like Snowflake and Azure Required Knowledge, Skills, and Experience Knowledge & Experience 4-6+ years of data engineering experience. 2-4 years of experience with SQL including, but not limited to: PostgreSQL, T-SQL, PL/SQL, SNOWSQL (specifically, but not limited to, PostgreSQL, T-SQL, PL/SQL, SNOWSQL) 2-4+ years of experience with building applications, system integrations, and web services 2-4+ years of experience with server-side scripting and programming in a Linux environment (primarily bash shell) Advanced understanding of common database (Oracle, Snowflake) technologies including performance, tuning, and optimization. Advanced data manipulation skills and experience with on-prem and cloud-based data warehouse ETL tools and processes Basic understanding of business processes such as OTC, P2P,PIM to understand context of data usage Technical Skills Data security Automated testing tools Version control tools Preferred Knowledge, Skills, and Experience 4-6 years’ experience with IDMC, programming languages like Python, Bash and SQL 4-6 years’ experience with data engineering principles and Data Quality Principles 2-4 years’ experience with Cloud Platforms like Azure and Snowflake"
    },
    {
        "index": 10,
        "description": "Lead Software Engineer- ServiceNow The ServiceNow Lead Software Engineer is responsible for developing and contributing to cutting edge, innovative solutions with the latest and greatest technology to revolutionize our industry. In addition, this position provides mentorship and actively facilitates the team’s development life cycle and ensures effective DevOps procedures are in place (automated builds, deployments, performance testing, etc.) What you’ll be doing: Develop software according to requirements and quality standards as well as deliver within defined timeframes with minimal rework Demonstrate core competency in programming fundamentals and best practices such as SOLID, Object-Oriented design principles, DRY, and Domain Driven Design Design, build and maintain high performing, reusable, and reliable code Participate in all phases of SDLC including design, development, testing, documentation, and support. Collaborate with business analysts and the user community to develop solutions that meet specific business objectives Understand business requirements, designs, and wireframes with the ability to transform them into technical requirements and produce high quality code Identify, document and implement programming patterns and set standards that increase developer productivity and code quality Perform code reviews to enforce patterns and standards in our code base Lead POCs, design sessions, and pair programming efforts Lead code Katas, and team training consistently Mentor junior team members as well as actively teach best practices and new technologies Work with management to assess technical talent and team training opportunities Focus on design and code architecture and implementation Present new technologies, ideas, and options to management clearly and concisely Effectively transform conceptual and theoretical discussions into implementable solutions Assist with onboarding and training new team members Work directly with QA Analysts and Engineers to ensure proper tests are designed to meet acceptance criteria to produce high quality products Be available as needed to support production deployments Support, troubleshoot and resolve production issues, including direct interactions with internal and/or external customers as needed Be a strong problem solver and possess an excellent work ethic and attitude Function as an excellent team player that can make significant contributions individually as well as a part of the team Demonstrate willingness to work on your craft and take initiative in learning new skills Effectively communicate both orally and in writing as well as manage multiple assignments and priorities Possess strong organizational and process analysis skills Participate in interviews upon request Other duties as assigned What we’re looking for: Experience with Visual Studio, GIT and Azure DevOps Design, develop, and implement complex ServiceNow solutions (including custom applications, business rules, client scripts, UI policies, and workflows). Lead integrations with external applications and third-party systems using REST/SOAP APIs, JSON, XML, and integration platforms. Possess in-depth knowledge of multiple ServiceNow modules (ITSM, ITOM, ITBM, HR, CSM) and advanced configuration capabilities. Demonstrate strong proficiency in JavaScript (and familiarity with AngularJS or similar frameworks), as well as front-end development (HTML, CSS). Exhibit solid understanding of SQL, relational database concepts, and data modeling for optimized ServiceNow performance. 7+ years of application development experience or demonstrate equivalent skills across the following technologies: .NET Framework/Core Angular C# JSON SCSS/SASS SQL Test Driven Development/Unit Testing Typescript, ES6 Web API/Rest Bonus Points: Working knowledge or experience with any of the following technologies: Agile Methodology Asynchronous Programming Azure Data Bricks Azure Data Factory Azure Functions Azure Logic Apps Azure PAAS Browser Compatibility Testing Cosmos DB CQRS Pattern Dependency Injection Entity Framework & LINQ MicroServices OData Python Education: Bachelor’s degree or higher in Computer Science or related degree is preferred. Travel: <5% If you are a qualified individual with a disability or a disabled veteran, you may request a reasonable accommodation if you are unable or limited in your ability to access job openings or apply for a job on this site as a result of your disability. You can request reasonable accommodations by calling 1-877-778-8707. Park Place Technologies is an Equal Opportunity Employer M/F/D/V. Park Place Technologies has an in-house recruiting team that focuses exclusively on the hiring needs of our company. We are not currently accepting additional third-party agreements or unsolicited resumes. If you would like to be considered as a preferred partner with Park Place Technologies, please submit your detailed information to *******@parkplacetech.com. Any CVs submitted directly to hiring managers will be considered unsolicited and become the property of Park Place Technologies."
    },
    {
        "index": 11,
        "description": "From the day we opened our doors in 1971, MRI Software has built flexible, game-changing real estate software solutions to improve people’s lives. The only way to carry out that mission is to hire the absolute best employees on earth. People like you. Work hard, play hard. Always. Our relentless commitment to client success, our employee resource groups and our promise to empower our teams to reach their full potential are a few examples of what makes MRI Software special. And we’re passionately dedicated to creating a work environment that you look forward to every single day. That’s why we invest heavily in our employee engagement, so you enjoy the tech industry’s best perks. Together with the whole Pride, (lion roar for \"family\") employees, customers, and partners, we’re on a mission to break new ground and lead the real estate industry into a digital-first future. We understand the need to provide a flexible working environment partnered with team collaboration and socialization. Therefore, we operate a hybrid working model with 3 days in-office and 2 days remotely. This role is based at our HQ in Solon, Ohio. Applicants must be authorized to work for ANY employer in the U.S. We are unable to sponsor or take over sponsorship of an employment Visa at this time. The Role: The Demo Engineer plays a pivotal role in ensuring MRI Software’s demo environments are functional, localized, and impactful for the North American Market. This role combines technical expertise with regional insights, enabling the delivery of high-quality, tailored demo experiences that meet client and prospect needs. The Demo Engineer serves as a critical bridge between the regional Presales teams and the global Demo Engineering team. Key Responsibilities Regional Demo Customization: Adapt demo environments to meet specific market needs, compliance requirements, and audience expectations in the assigned region. Collaborate with local sales and marketing teams to craft customized demo experiences that resonate with regional clients. Demo Environment Management: Manage and maintain demo environments to ensure they are updated with the latest product versions, features, and branding. Troubleshoot and resolve technical issues to guarantee a seamless demo experience. Technical Support: Provide technical expertise and direct support to regional Presales teams for smooth demo delivery. Act as the first point of contact for resolving demo-related technical challenges in the region. Collaboration and Feedback: Serve as a regional liaison to the global Demo Engineering team, sharing insights and feedback to foster continuous improvement. Work closely with other Demo Engineers across regions to maintain consistency in demo quality and delivery. User and Access Management: Oversee user account creation and access management for MRI demo environments, ensuring secure and efficient usage. Maintain detailed documentation for demo environment configurations, troubleshooting processes, and setup procedures. Required Skills and Qualifications Experience 3+ years of experience in a technical support, demo engineer, or Presales role, preferably within software or technology industries. Hands-on experience managing demo environments or supporting sales and Presales activities. Hands-on application of MRI products is preferred. Technical Proficiency Proficient in managing technical environments, with familiarity in system setup, configuration, and maintenance. Experience with CRM tools (e.g., Salesforce), demo platforms, and project management tools. Basic knowledge of coding, scripting, or system integrations is a plus. Problem-Solving Skills Strong troubleshooting abilities to identify and resolve technical issues quickly. Analytical mindset to understand complex demo requirements and propose creative solutions. ] We’re obsessed with making this the best job you’ve ever had! We want our teams to love working here, so we’ve created some incredible perks for you to enjoy: Join our employee-led groups to maximize your experience at work such as our Diversity, Equity and Inclusion committee, employee resource groups such as Women and Allies, and our Pride Event Group Enjoy peace of mind over yours and your family’s health with our medical coverage options and HSA benefit Invest in our competitive 401k plan and help set you up for your future Big on family? So are we! We understand family is important and being able to spend quality time with your family is a wonderful experience. Our Parental Leave Program is designed to give you the opportunity to spend even more time with your new arrival(s) Enjoy a fantastic work-life balance with 20 days PTO plus observed Holidays, plus 16 hours of ‘Flexi’ time a year Further your professional development and growth with our generous Tuition Reimbursement offerings Enjoy the flexibility of working from anywhere in the world for two weeks out of the year At MRI, our company culture is more than a talking point – it’s what makes us shine! We value your hard work and encourage you to be your whole self while you do it. Passion, integrity, and inclusion mixed with a healthy dose of fun is what makes us the best fit for your next career move! MRI continues to strive to amaze as a global industry leader in real estate software. Whether you are joining as a new pride member or bringing your expertise back, your talent is important to maintaining MRI’s high client experience standard and continuing our growth in the PropTech space. Amazing growth takes amazing employees. Are you up to the challenge? We are not accepting unsolicited resumes from agencies and/or search firms for this job posting. Environmental Conditions This person will work predominantly in an office type environment. Physical Demands While performing the duties of this job, the employee is regularly required to sit up to 8 or more hours a day. The employee is frequently required to see, hear and speak. The employee may be required to work at a computer work station for more than 5 hours a day. Mental Demands Reading, studying focused listening, auditing, inspecting, proofreading, and evaluating required. Ability to give, receive, and analyze information and prepare written materials. Ability to communicate effectively (verbal and written); interpret policy, procedures, and data. MRI Software is an Equal Opportunity Employer. Regardless of your race, color, religion, sex, national origin, sexual orientation, gender identity, disability, age, veteran status, you are welcome here. Soft Skills Excellent communication skills to collaborate effectively with Sales, Presales, Marketing, and Product teams. Highly organized and detail-oriented, with strong time management skills to handle multiple priorities. Team player with a proactive approach to problem-solving and a focus on continuous improvement. Certifications (Preferred) Relevant certifications in systems administration, cloud platforms, or project management (e.g., AWS, Azure, PMP, etc.)."
    },
    {
        "index": 12,
        "description": "ABOUT THE ROLE: The Lead Application Developer, Full Stack role will be responsible for leading the broader process of developing and deploying enhancements and/or new applications used in local, networked, cloud-based or internet-related computer programs. They will use their extensive expertise in programming languages, tools, and delivery models, in conjunction with their methodology expertise to collaborate with various stakeholders and ensure the timely delivery of high-quality products and solutions. This role requires an expert understanding of programming languages, tools, and delivery models, as well as the ability to effectively communicate technical solutions to non-technical stakeholders. The incumbent will lead multiple stakeholders, including project teams, business analysts, and end-users, to ensure the development process is running smoothly. Ultimately, the incumbent will play a pivotal role in ensuring the organization's software applications are effective, efficient, and provide a seamless experience for the end-users. Here, we believe there’s not one path to success, we believe in careers that grow with you. Whoever you are or wherever you come from in the world, there’s a place for you at Sherwin-Williams. We provide you with the opportunity to explore your curiosity and drive us forward. Sherwin-Williams values the unique talents and abilities from all backgrounds and characteristics. All qualified individuals are encouraged to apply, including individuals with disabilities and Protected Veterans. We’ll give you the space to share your strengths and we want you show us what you can do. You can innovate, grow and discover in a place where you can thrive and Let Your Colors Show! At Sherwin-Williams, part of our mission is to help our employees and their families live healthier, save smarter and feel better. This starts with a wide range of world-class benefits designed for you. From retirement to health care, from total well-being to your daily commute—it matters to us. A general description of benefits offered can be found at http://www.myswbenefits.com/. Click on “Candidates” to view benefit offerings that you may be eligible for if you are hired as a Sherwin-Williams employee. Compensation decisions are dependent on the facts and circumstances of each position, which will impact where actual compensation may fall within the stated wage range. The wage range listed for this role takes into account the wide range of non-discriminatory factors considered in making compensation decisions including geographic location; skill sets; experience and training; licensure and certifications; and other business and organizational needs. The wage range, other compensation, and benefits information listed is accurate as of the date of this posting. The Company reserves the right to modify this information at any time, with or without notice, subject to applicable law. Qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable federal, state, and local laws including with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act where applicable. Sherwin-Williams is proud to be an Equal Employment Opportunity/Affirmative Action employer committed to an inclusive and diverse workplace. All qualified candidates will receive consideration for employment and will not be discriminated against based on race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age, pregnancy, genetic information, creed, marital status or any other consideration prohibited by law or by contract. As a VEVRAA Federal Contractor, Sherwin-Williams requests state and local employment services delivery systems to provide priority referral of Protected Veterans. Please be aware, Sherwin-Williams recruiting team members will never request a candidate to provide a payment, ask for financial information, or sensitive personal information like national identification numbers, date of birth, or bank account numbers during the application process. WHAT THE ROLE WILL DO: Oversee the process of analyzing system requirements by providing guidance on translating requirements into software programming specifications and mentoring the team of engineers Oversee and share perspective in the development, coding, integration, testing, and debugging of software applications using current programming languages, while leveraging the expertise of the team members and ensuring the delivery of high-quality solutions Drive the creation of detailed and user-friendly documentation and procedures for the installation and maintenance of software, ensuring all best practices are being followed by the team Drive strategies to manage and facilitate collaboration and communication with various stakeholders such as users, developers, and project managers to ensure timely delivery of products and solutions. Encouraging the adoption of emerging technologies and programming languages that strategically aligning with the organization's overall technology roadmap and objectives This position is not eligible for sponsorship for work authorization now or in the future, including conversion to H1-B visa. This position has a hybrid work schedule with three days in the office and the option for working remotely two days. Job duties include contact with other employees and access confidential and proprietary information and/or other items of value, and such access may be supervised or unsupervised. The Company therefore has determined that a review of criminal history is necessary to protect the business and its operations and reputation and is necessary to protect the safety of the Company’s staff, employees, and business relationships. Travel: 5% WHAT THE INCUMBENT WILL NEED: Education Required Bachelor's degree in Computer Science or a related field. In lieu of a degree, at least 9 years of experience in application development or application engineering Required Knowledge, Skills, and Experience 6-8 years of experience in software development, specifically in application development engineering Expertise in programming languages such as SQL, Java, C#, .NET Excellent written and verbal communication skills Excellent ability to work collaboratively with cross-functional teams Ability to mentor and coach junior developers Technical Skills Database Management Systems Front-End Development Tools Programming Languages Data Analysis Software Development Lifecycle (SDLC) Methodology Front-End Coding Languages Web Services & APIs Systems Integration Software Testing & Quality Assurance Methodologies & Tools Version Control Tools Preferred Knowledge, Skills, and Experience Proficiency in PL/SQL: Oracle's procedural extension for SQL, to write complex scripts and stored procedures Oracle Database Management: This includes tasks like database objects design, performance tuning, and troubleshooting Formula Structure: Expertise with Formulation system and data ETL, and formulation data structures (BOM, Properties, Specs, Remarks, etc.)"
    },
    {
        "index": 13,
        "description": "Summary Designs, develops, and implements cost-effective automated methods of functionally testing and troubleshooting manufactured product including electronic assemblies and printed circuit boards. Prepares test and diagnostic programs, designs test fixtures and equipment, and completes specifications and procedures for new products. Scope of work will include new product development (NPD), legacy equipment support, and continuation engineering. This test equipment consists of electronic / electrical / mechanical measurement and controls, mechanical fixtures and software which are used in global manufacturing facilities to produce Rockwell Automation products Roles & Responsibilities • Develop and debug test software to control the electrical and mechanical components of the functional test system to provide a robust, reliable and repeatable manufacturing test system. • Create and release documentation on all aspects of the test solution. • Test specification to document product testing and coverage. • System/Test Fixture wiring schematics in AutoCAD Electrical. • System/Test Fixture BOM (Bill of Materials). • Create User s guide to assist plant engineering with long term support. • Test software and documentation released into appropriate source control location. Minimum Qualifications Minimumof 5 years of experience as a Manufacturing Functional Test Engineer creatingand supporting test solutions Abilityto independently design, develop, implement and support test programs forautomated electronic test equipment that test electronic manufactured productusing C# or other object oriented text based languages (National InstrumentTest Stand experience is a plus). Experiencewriting test software with communications protocols such as Device Net,RS485/422, TCP/IP, CAN, etc. Experiencewriting test software to communicate with electronic instruments like Meters,Power Supplies, O-Scopes. Abilityto create test plans, user guides and test specification documentation Strongunderstanding of electronics (ohms law, ability to read and understandelectronic schematics for printed circuit boards) Abilityto review product electronic schematics and evaluate what stimulus and response(outputs) are required in order to fully test the manufactured product. Experiencedeveloping manufacturing test solutions for analog and digital electronics PLCprogramming knowledge a plus Must befluent in reading, writing, and speaking English. Exhibitgood interpersonal, verbal, and written communication skills, the ability towork in teams, and very strong problem solving skills. Bachelor'sdegree in Electrical Engineering or equivalent education or experience Required Skills Work Authorization US Citizen Green Card"
    },
    {
        "index": 14,
        "description": "Salary Range: $65k - $100k Permanent Position with Exceptional Benefits. Southern Cleveland, Ohio area design firm is seeking to hire a several Civil Engineers experienced with wastewater or subdivision layout and design. REQUIREMENTS Bachelor Degree in Engineering (Jr. level Licensed Professional Engineer is STRONGLY preferred ) Proficient with AutoDesk / AutoCAD Civil 3D Software Subdivision layout and design, highway and intersection design or storm water / waste water design Plan preparation and contract administration for private clients Subdivision layout and design, highway and intersection design, hydrological studies, storm water management, post construction water quality, site grading, earthwork calculations, erosion protection, subgrade stabilization and drainage, sanitary sewer and water line layout, quantity calculations, bidding and contract agreements, construction administration and related tasks. Candidates are required to pass a Criminal Background Check and a 10 Panel Drug Screen. Only U.S. Citizens or persons with a Green Card work permit may apply. Due to the large amount of resumes we expect to receive only the most qualified candidates will be contacted. We will retain all other resumes for any future job considerations. Email your resume to: Attention: JOB 440-25-01076 Please reference: \"Civil Engineer - JOB 440-25-01076\" when applying for this position."
    },
    {
        "index": 15,
        "description": "Conduct penetration testing and evaluate security risks for embedded software, hardware, wireless, and cloud products. Advise product teams on risk and mitigation strategies. Develop security tools such as fuzzers when Commercial Off-The-Shelf tools are not available. Maintain lab infrastructure and serve as lab captain for the Security V&V Lab located in Mayfield Heights, Ohio. Research current security trends regarding industrial control systems, software, embedded systems, hardware design, cloud-to-edge, and application security. Collaborate with security experts to ensure security requirements are implemented. Design and implement product and system security test set-ups. Stay current on the \"vulnerability landscape\" and potential attacks. Evaluate the potential impact of publicly identified attacks on Rockwell Automations product portfolio. Full time employment, Monday Friday, 40 hours per week. MINIMUM REQUIREMENTS: Must have a bachelors degree or foreign equivalent in Computer Science, Computer Engineering, Cyber-Security, Information Security, or a related field, and 5 years of progressive post-baccalaureate related work experience. Alternatively, the employer will accept a masters degree or foreign equivalent in Computer Science, Computer Engineering, Cyber-Security, Information Security, or a related field, and 3 years of related work experience. Must have 3 years of experience in each of the following: Python Programing; Developing software for custom development projects and web applications using Java, C++, PHP, JS, or Angular; Utilizing Windows and Linux operating systems; Performing Cloud, Embedded Software, Wireless, and Hardware penetration testing; and Lab Infrastructure Maintenance, including VMware vSphere. Telecommuting permitted up to 2 days per week. Employer will accept any suitable combination of education, training, or experience. TO APPLY: please email your resume to and reference the following job ID number in the subject line: RA."
    },
    {
        "index": 16,
        "description": "Join a prestigious, award-winning architecture and engineering firm known for delivering exceptional results across public and private sectors nationwide. With a history of high-impact projects and a reputation for innovation, this firm offers an exciting opportunity for a talented Geotechnical Engineer with experience in water resources (dams, levees, locks) to grow and make a meaningful impact. As the firm continues to expand, you'll play a key role in shaping the future of critical infrastructure projects. Geotechnical Engineer Responsibilities: Lead the design and analysis of support systems for excavation projects, particularly in urban environments, with a focus on water resources infrastructure such as dams, levees, and locks. Conduct in-depth site investigations, perform soil testing, and assess subsurface conditions for water resources projects. Prepare and present technical reports, including detailed calculations for excavation safety, shoring, bracing, and retaining wall systems for water-related infrastructure. Manage multiple geotechnical projects, ensuring they are completed on time, within scope, and to the highest standards. Collaborate closely with project managers, multidisciplinary teams, and clients to ensure seamless execution of projects. Drive compliance with industry regulations and safety standards while coordinating with contractors, authorities, and clients. Contribute to the preparation of proposals and cost estimates for new water resources projects. Mentor junior engineers and provide hands-on guidance in the field and on-site consultations. Geotechnical Engineer Qualifications: 3 to 10 years of experience in geotechnical engineering, with a focus on excavation design and water resources infrastructure (e.g., dams, levees, locks). PE or EIT certification preferred (or the ability to obtain one). Strong experience with excavation projects, including shoring, retaining walls, foundations, and water infrastructure. Proficiency with geotechnical design software like PLAXIS, GeoStudio, or similar tools. Excellent written and verbal communication skills, with experience preparing technical reports. Ability to manage projects independently and remotely. Willingness to travel to various project sites as necessary. Why Join Us? Be part of a renowned, growing firm recognized for its contributions to critical water resources infrastructure. Enjoy a comprehensive benefits package, including health, dental, and vision insurance. Take advantage of a competitive 401(k) plan and flexible work schedule, including remote work options. Access professional development opportunities with clear career growth potential. Contribute to impactful projects that enhance communities and infrastructure nationwide. For more information or to explore this opportunity further, reach out to Tamla Rahn at or call . All qualified applicants will receive consideration without regard to race, age, color, sex (including pregnancy), religion, national origin, disability, sexual orientation, gender identity, marital status, military status, genetic information, or any other status protected by applicable laws or regulations. GPAC (Growing People and Companies) is an award-winning search firm specializing in placing quality professionals within multiple industries across the United States since 1990. We are extremely competitive, client-focused and realize that our value is in our ability to deliver the right solutions at the right time."
    },
    {
        "index": 17,
        "description": "Middough Inc. - 'TOP WORKPLACES' Award Winner! Senior Civil Engineer - Position and Responsibilities As a Senior Civil Engineer with Middough, you will be in a Discipline Lead role to exercise your engineering leadership and management skills in collaboration with cross-discipline teams on various projects (industrial clients or utility providers and suppliers). You will also manage departmental project aspects related to resources, work scope, project schedule and budget. Work scopes generally involve site planning, land development and underground utility design (water, stormwater, and wastewater) spanning conceptual phases throughout construction phases of projects. The projects will vary in complexity from smaller scale, single-discipline roles (utility extensions, minor roadways, etc.) to major, multi-discipline, complex infrastructure/building and site improvement projects. Responsibilities include, but are not limited to, the following: Collect and prepare data/information and perform detailed engineering design and calculations with support of a licensed professional engineering manager. Develop technical specifications and work scopes. Assist and provide leadership in field work for design development and problem-solving activities. Support collaboration for Owner/Vendor/Contractor submittals and RFI's. Coordinate with Owner representatives, Contractors, and other project stakeholders, with the goal of ensuring the successful execution of projects. Interact with other departments and suppliers to obtain pertinent information. Serve as Discipline Lead on complex, multi-discipline projects by estimating work hours, developing scope of work, making staffing recommendations, and checking drawings. Self-perform and/or collaborate with others (using software and design aids), including design and engineering to produce engineering deliverables in compliance with accepted engineering principles, company standards and the customer contract specifications while achieving value engineering design that meets client requirements for operability, reliability, maintainability, and safety. Other project requirements may include: Design of industry rail access and yard track layout. Preparation of permit applications and documents for review agency permitting. Coordination of work with project team. Coordinate and direct survey services to be performed by others. Prepare exhibits for client or public presentations. Provide leadership and mentoring to other staff members. Education, Experience and Skills The successful candidate is desired to possess the following: Bachelor of Science degree in Civil Engineering. EIT certification required, PE license preferred. 10+ years of experience in site development engineering. Prior management experience preferred. Experience throughout all phases of engineering and construction preferred. Current, active and advanced AutoCAD Civil 3D experience. Current and active use of BIM collaboration tools. Working knowledge of Microsoft Office Suite. Strong analytical, problem-solving, and attention to detail abilities. Ability to multitask and organize for project efficiency. Strong written and interpersonal communication skills. Physical Requirements The characteristics described below are representative of those encountered while performing the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing duties of this position, the successful candidate will: Remain in a stationary position, often standing or sitting for prolonged periods. Frequently walk, reach with hands and arms, climb stairs, balance, stoop or kneel, bend or twist, use repeating motions that may include the wrists/hands/fingers and talk and hear. Frequently use up-close vision, distance vision, depth perceptions, and the ability to adjust focus. Should not expect adverse environmental conditions within company offices. May be exposed to adverse environmental conditions (such as climbing ladders and/or stairs, extreme heat and/or cold, and/or poor air quality) if or when on-site at a client facility. Safety protections provided by the client and/or company are required to be used and followed. May require occasional car or air travel to other company locations or client sites. This position requires the candidate/employee to possess and maintain a valid driver's license in their state of residence and auto insurance coverage. About Middough Middough Inc. (Middough), founded in 1950, is a leading professional engineering, architecture and project solutions company providing services to a broad spectrum of Fortune 500 clients in nine core industries with offices across the Central, Midwest and Northeast regions. Our diversified team is our greatest asset, and they are challenged with a large variety of interesting projects, management and technical development opportunities and team building experiences. Middough employs the best and brightest individuals who share our passion for excellence and who are dedicated to client satisfaction, quality service, safety awareness and professional development. What Middough Offers We offer a growth and learning culture which encourages and supports employee development through a wide variety of tools and resources such as the company Learning Management System, Middough Learning Center. Middough provides an opportunity to bring your talents and expertise to a successful and growing organization for your career advancement goals. Additionally, we offer a highly competitive compensation and the following comprehensive benefits package, based on eligibility and plan terms/changes: A hybrid work model for work-life flexibility (based on business and client needs) Medical, Dental, and Vision coverage Company paid Short/Long Term Disability, Life, AD&D, and Travel Insurance Health Saving and Flexible Spending Accounts 401(k) Plan Paid Time Off, Company Paid Holidays Tuition Assistance Paid Certifications and Registrations (as applicable) Employee Assistance Program Middough participates in the Department of Homeland Security (DHS) and Social Security Administration (SSA) E-Verify program to confirm work authorization. Equal Opportunity Employment We are an equal opportunity employer and value diversity at our company. We provide equal employment opportunities to all employees and applicants for employment and prohibit discrimination and harassment of any type without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, status as a parent, national origin, age, disability (physical or mental), family medical history or genetic information, political affiliation, military service, or other non-merit based factors or any other protected characteristic under protected by federal, state, or local laws. Middough does not support sponsorship for any applicant that requires an employment visa (i.e., H-1B) to work lawfully in the US."
    },
    {
        "index": 18,
        "description": "Middough Inc. - 'TOP WORKPLACES' Award Winner! Senior Instrumentation & Controls Engineer - Position and Responsibilities As a Senior Instrumentation & Controls Engineer (I&C) with Middough, you will collect and prepare data/information and perform detailed engineering calculations. The I&C Engineer will also interact with design staff, senior department personnel, project management, contractors, and our valued clients. The I&C Engineer will demonstrate technical and professional growth annually by maintaining active membership in professional organizations and participating in technical seminars and/or courses. Responsibilities include, but are not limited to, the following: Work on multiple projects of moderate size or portions of major projects. Design complete I&C solutions based on project scope definition. Prepare project documentation including but not limited to bills of material, calculations, data sheets, detailed drawings, specifications, technical reports, and test plans. Coordinate tasks with engineers, designers, and administrative staff. Perform technical evaluation of bids and recommend best value design which meets client requirements for operability, reliability, maintainability, and safety. Participate in safety reviews (i.e., HAZID, HAZOP). Lead field work by evaluating installations and performing problem-solving activities. Perform calculation checks and vendor drawing reviews. Serve as lead on single and multi-discipline projects by estimating work hours, developing scope of work, and checking drawings. Interact with other disciplines and suppliers to obtain pertinent information. Manage the scope of the project work, address scope and work changes, adjust the project deliverables as necessary, and complete the project work based on the budget and scheduled time frame. Present project information to both internal and external client audiences. Education, Experience and Skills The successful candidate will possess the following: Bachelor of Science in an Engineering discipline required. Professional Engineer license (preferred). 10+ years of experience performing engineering analysis and design for instrumentation and controls systems. Understanding of NEC/ISA standards. Strong skill set in understanding PFD's, P&ID's, and Cause & Effect Matrices. Interface experience with DCS/PLC platforms including HMI and reporting software packages. Strong background in control system architecture and interface solutions including configuration of switches, servers, and operator workstations. Experience specifying field instrumentation and process analyzers for applications including basic process control, safety instrumented systems and fire and gas detection; includes development of installation details and loop drawings. Experience with estimating engineering project costs. Working knowledge of Smart Plant Instrumentation would be an asset. Working knowledge of Databases and AutoCAD. Working knowledge of Microsoft Office products. Excellent analytical, problem-solving, and attention to detail abilities. Ability to multitask and organize for project efficiency. Strong interpersonal and communication skills. Physical Requirements The characteristics described below are representative of those encountered while performing the essential functions of this position. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. While performing duties of this position, the successful candidate will: Remain in a stationary position, often standing or sitting for prolonged periods. Frequently walk, reach with hands and arms, climb stairs, balance, stoop or kneel, bend or twist, use repeating motions that may include the wrists/hands/fingers and talk and hear. Frequently use up-close vision, distance vision, depth perceptions, and the ability to adjust focus. Should not expect adverse environmental conditions within company offices. May be exposed to adverse environmental conditions (such as climbing ladders and/or stairs, extreme heat and/or cold, and/or poor air quality) if or when on-site at a client facility. Noise levels may be moderate to high at various client sites, hearing protection may be required and/or provided. Safety protections provided by the client and/or company are required to be used and followed. May require occasional car or air travel to other company locations or client sites. This position requires the candidate/employee to possess and maintain a valid driver's license in their state of residence and auto insurance coverage. About Middough Middough Inc. (Middough), founded in 1950, is a leading professional engineering, architecture and project solutions company providing services to a broad spectrum of Fortune 500 clients in nine core industries with offices across the Central, Midwest and Northeast regions. Our diversified team is our greatest asset, and they are challenged with a large variety of interesting projects, management and technical development opportunities and team building experiences. Middough employs the best and brightest individuals who share our passion for excellence and who are dedicated to client satisfaction, quality service, safety awareness and professional development. What Middough Offers We offer a growth and learning culture which encourages and supports employee development through a wide variety of tools and resources such as the company Learning Management System, Middough Learning Center. Middough provides an opportunity to bring your talents and expertise to a successful and growing organization for your career advancement goals. Additionally, we offer a highly competitive compensation and the following comprehensive benefits package, based on eligibility and plan terms/changes: A hybrid work model for work-life flexibility (based on business and client needs) Medical, Dental, and Vision coverage Company paid Short/Long Term Disability, Life, AD&D, and Travel Insurance Health Saving and Flexible Spending Accounts 401(k) Plan Paid Time Off, Company Paid Holidays Tuition Assistance Paid Certifications and Registrations (as applicable) Employee Assistance Program Middough participates in the Department of Homeland Security (DHS) and Social Security Administration (SSA) E-Verify program to confirm work authorization. Equal Opportunity Employment We are an equal opportunity employer and value diversity at our company. We provide equal employment opportunities to all employees and applicants for employment and prohibit discrimination and harassment of any type without regard to race, color, religion, sex, gender identity, sexual orientation, pregnancy, status as a parent, national origin, age, disability (physical or mental), family medical history or genetic information, political affiliation, military service, or other non-merit based factors or any other protected characteristic under protected by federal, state, or local laws. Middough does not support sponsorship for any applicant that requires an employment visa (i.e., H-1B) to work lawfully in the US."
    },
    {
        "index": 19,
        "description": "Strong Associate Architect Planner within the Construction industry needed to join a growing team! This Jobot Job is hosted by: Ryan Anderson Are you a fit? Easy Apply now by clicking the \"Apply\" button and sending us your resume. Salary: $85,000 - $95,000 per year A bit about us: Are you an experienced Architect Planner seeking an exciting new opportunity? We are a leading construction firm seeking a detail-oriented, innovative, and experienced Permanent Associate Architect Planner to join our dynamic team. In this role, you will play a critical part in the planning and development of our construction projects, ensuring they meet client specifications and adhere to local zoning laws. You will be responsible for creating detailed construction documentation, blueprints, and drawings, and will work closely with our team of engineers and construction professionals to bring our projects to life. Why join us? Competitive compensation and benefits packages! Job Details Responsibilities: Collaborate with project managers, engineers, and construction teams to plan and design construction projects. Develop and prepare detailed architectural designs and plans using CAD software. Create comprehensive construction documentation, including blueprints, drawings, and specifications. Conduct feasibility studies and risk assessments for proposed projects. Ensure all plans and designs adhere to local zoning laws and regulations. Review and approve project designs and plans, ensuring they meet client specifications and quality standards. Coordinate with local authorities and stakeholders during the planning and development process. Participate in project meetings, providing architectural and planning expertise. Monitor project progress, making adjustments to plans and designs as needed. Qualifications: Bachelor's Degree in Architecture, Planning, or related field. Minimum of 5 years' experience in architecture planning, development, and construction. Proven experience as an Associate Planner or Associate Architect. Proficient in CAD software and other architectural design tools. Strong knowledge of construction documentation, blueprints, and drawings. Excellent understanding of zoning laws and regulations. Exceptional project management and coordination skills. Strong analytical and problem-solving skills. Excellent communication and interpersonal skills, with the ability to collaborate effectively with a team. Attention to detail and a high degree of accuracy. Ability to manage multiple projects simultaneously and meet deadlines. Professional Architectural license is preferred. Interested in hearing more? Easy Apply now by clicking the \"Apply\" button."
    },
    {
        "index": 20,
        "description": "Description & Requirements The Cloud Engineering Intern is a hands-on position that requires the ability to work with established Cloud Engineers in a fast paced technological environment. The hired candidate will participate in planning, design, and the implementation of technical cloud solutions. The Intern will help combine software and systems to develop creative engineering solutions for streamlined operations. You will will join a dedicated team of professionals with a diverse set of experience and skills. In this environment, the intention is to provide a hands-on experience for established AWS/Azure/Google support teams, supported by a larger matrixed IT organization. This opportunity is remote within the US only and from any time zone. Additionally, the selected intern will gain knowledge of general business principles, corporate organizational structure and government process improvement. Throughout the summer, you will have the opportunity to meet, interact, and collaborate among various project teams, consultants, senior management, executives and peers. Guidance and training on operations standards and protocols will be provided by the Manager. BENEFITS / COMPENSATION: Hourly pay range is competitive and commensurate with education and experience. Interns are eligible for benefits. All computer equipment and access to digital systems will be provided to the hired candidate. Students may also complete the internship for academic credit, subject to the qualifications of their academic program. PROGRAM DETAILS: This position requires a commitment of 40 full-time hours per week, with availability during usual business hours (8AM-6PM ET), for the duration of a 10-week summer program: starting Tuesday, May 27th and ending Friday, August 8th, 2025 Essential Duties and Responsibilities: - Work on IT assignments of moderate difficulty, under the direction of a more senior mentor, to build a well-rounded skillset - Escalate issues and questions to management as necessary - Participate in group discussions with peers or external groups to solution problems of moderate scope - Participate in meetings to gain process knowledge and guidance on assigned projects - Read, understand and perform assignments within prescribed guidelines - Approach challenges and create solutions with a critical thinking and customer service mindset - Prepare standard reports and presentation materials. Minimum Requirements - Currently enrolled in an accredited college or university and pursuing a college degree in a related major including systems, technical, engineering, analytics, or similar field. - Must have completed 2 years of coursework. - Good organizational, planning, and time management abilities. - Strong interpersonal communication, teamwork, and customer service skills. - Limited use and/or application of basic principles, theories, and concepts. Ideal candidate will have AWS experience, Operating System knowledge and a cloud engineering background. EEO Statement Active military service members, their spouses, and veteran candidates often embody the core competencies Maximus deems essential, and bring a resiliency and dependability that greatly enhances our workforce. We recognize your unique skills and experiences, and want to provide you with a career path that allows you to continue making a difference for our country. We’re proud of our connections to organizations dedicated to serving veterans and their families. If you are transitioning from military to civilian life, have prior service, are a retired veteran or a member of the National Guard or Reserves, or a spouse of an active military service member, we have challenging and rewarding career opportunities available for you. A committed and diverse workforce is our most important resource. Maximus is an Affirmative Action/Equal Opportunity Employer. Maximus provides equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disabled status. Pay Transparency Maximus compensation is based on various factors including but not limited to job location, a candidate's education, training, experience, expected quality and quantity of work, required travel (if any), external market and internal value analysis including seniority and merit systems, as well as internal pay alignment. Annual salary is just one component of Maximus's total compensation package. Other rewards may include short- and long-term incentives as well as program-specific awards. Additionally, Maximus provides a variety of benefits to employees, including health insurance coverage, life and disability insurance, a retirement savings plan, paid holidays and paid time off. Compensation ranges may differ based on contract value but will be commensurate with job duties and relevant work experience. An applicant's salary history will not be used in determining compensation. Maximus will comply with regulatory minimum wage rates and exempt salary thresholds in all instances. Minimum Salary $21.00 Maximum Salary $25.00"
    },
    {
        "index": 21,
        "description": "Description & Requirements We are looking for an experienced systems engineer with demonstrated success designing and developing solutions for complex applications problems, system administration issues, or network concerns. In addition, we are looking for an engineer with proven success leading systems management and integration functions for cloud-based applications and infrastructures. The Solution Architect will play a critical role in defining and implementing technology solutions that align with our business objectives. This role requires an understanding of the Software Development Lifecycle (SDLC), Product Development Lifecycle (PDLC), and Agile Development methodologies. The ideal candidate will have a proven track record of designing and delivering complex software systems, excellent problem-solving skills, and the ability to collaborate effectively with cross-functional teams. Essential Duties and Responsibilities: - Develop and maintain architecture that guide the development and integration of solutions. - Provide technical leadership and guidance to development teams throughout the SDLC, ensuring best practices and standards are followed to meet business needs. - Work closely with product managers, business analysts, business development and other stakeholders to understand requirements and translate them into technical solutions. - Evaluate and recommend tools, technologies, and processes to ensure the highest quality and performance of software solutions. - Identify and mitigate technical risks throughout the project lifecycle. - Create and maintain comprehensive documentation for architectural designs, technical specifications, and project plans. • Architectural Design: Develop and maintain architecture that guide the development and integration of solutions. • Technical Leadership: Provide technical leadership and guidance to development teams throughout the SDLC, ensuring best practices and standards are followed to meet business needs. • Stakeholder Collaboration: Work closely with product managers, business analysts, business development and other stakeholders to understand requirements and translate them into technical solutions. • Solution Evaluation: Evaluate and recommend tools, technologies, and processes to ensure the highest quality and performance of software solutions. • Risk Management: Identify and mitigate technical risks throughout the project lifecycle. • Documentation: Create and maintain comprehensive documentation for architectural designs, technical specifications, and project plans. Minimum Requirements - Bachelor's degree in relevant field of study and 3+ years of relevant professional experience required, or equivalent combination of education and experience. - Due to program requirements, this position requires the ability obtain and maintain a Public Trust clearance. - Due to program requirements, this position requires US Citizenship. - Broad experience with infrastructure and compute environments like AWS, Azure, VMWare. As well as SDLC, PDLC, and Agile methodologies - Prior experience with government proposal leading solution development. - Experience in designing and integrating complex systems. - Strong analytical and problem-solving abilities, with a focus on delivering high-quality solutions. - Excellent verbal and written communication skills, with the ability to convey complex technical concepts to non-technical stakeholders. Minimum Education requirement: University degree (BS) in a closely related field (Engineer, Computer Science) Years of Required Work-Related Experience: 4+ years of experience as an engineer, architect, or solution architect. #techjobs EEO Statement Active military service members, their spouses, and veteran candidates often embody the core competencies Maximus deems essential, and bring a resiliency and dependability that greatly enhances our workforce. We recognize your unique skills and experiences, and want to provide you with a career path that allows you to continue making a difference for our country. We’re proud of our connections to organizations dedicated to serving veterans and their families. If you are transitioning from military to civilian life, have prior service, are a retired veteran or a member of the National Guard or Reserves, or a spouse of an active military service member, we have challenging and rewarding career opportunities available for you. A committed and diverse workforce is our most important resource. Maximus is an Affirmative Action/Equal Opportunity Employer. Maximus provides equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disabled status. Pay Transparency Maximus compensation is based on various factors including but not limited to job location, a candidate's education, training, experience, expected quality and quantity of work, required travel (if any), external market and internal value analysis including seniority and merit systems, as well as internal pay alignment. Annual salary is just one component of Maximus's total compensation package. Other rewards may include short- and long-term incentives as well as program-specific awards. Additionally, Maximus provides a variety of benefits to employees, including health insurance coverage, life and disability insurance, a retirement savings plan, paid holidays and paid time off. Compensation ranges may differ based on contract value but will be commensurate with job duties and relevant work experience. An applicant's salary history will not be used in determining compensation. Maximus will comply with regulatory minimum wage rates and exempt salary thresholds in all instances. Minimum Salary $90,000.00 Maximum Salary $130,000.00"
    },
    {
        "index": 22,
        "description": "Description & Requirements Maximus has an exciting opportunity to join their team supporting a Federal financial client. As a Security Analyst you will have the chance to: • Proactively monitor vulnerability scans from multiple Security tools, ensuring identification as early as possible and generating remediation tickets in Jira • Support end-to-end ownership of security vulnerabilities from identification through deployment • Actively engage with client stakeholders (IT and Security Teams), leading discussions and communication on status and remediation for vulnerabilities stemming from injection threats, authentication and access control, data handling, configuration issues, and outdated software, • Perform evaluations of vulnerability findings to include the ability to effectively detect false positives produced from security scanning tools, and validate the remediation steps performed by development and infrastructure teams • Conduct investigations into security vulnerabilities and develop remediation actions that a developer or engineer could use in the mitigation of the threat • Develop and update required security-related documents (System Security Plan, Security Impact Analysis, Privacy Impact Analysis, etc.) and lead cross-team collaboration to fulfill CIO security policies as needed Maximus TCS (Technology and Consulting Services) Internal Job Profile Code: TCS056, T2, Band 5 Minimum Requirements: • Due to Fedderal requirements, all candidates must be US citizens and be able to pass a clearance process for a position of Public Trust • 3+ years of direct experience in IT (preferably Security focused) • Scripting experience in one or more of the following: Bash, Python, PowerShell • Operating Systems Experience: Both Linux/Unix and Windows • Experience reviewing findings in one or more of the following scanning tools: Tenable, BurpSuite, RedHat ACS, Veracode, Contrast, Imperva or similar scanning tools • Certifications (one or more): Security+, A+, Network+, Certified Ethical Hacker (CEH) • Excellent analytical and problem-solving skills, particularly as it applies to IT security • Excellent time management and organizational skills, and ability to handle multiple concurrent tasks and projects with minimal supervision • Proven ability to coordinate vulnerability fixes across development and infrastructure teams to reach an issue resolution in a timely manner • Demonstrated ability to build trusted advisor relationships with clients • Experience leading oral presentations to IT Security stakeholders and senior leadership • Proficient with technical documentation, especially with experience in write-ups on IT Security topics Minimum Requirements TCS056, T2, Band 5 Preferred Key Skills and Abilities: • Advanced Excel knowledge (i.e. vlookups, pivot tables) • Ability to work with Business Intelligence developers in providing requirements for systems and dashboards that normalize security data/findings and lead to efficiencies with vulnerability management through a disciplined prioritization process. • Experience working in a scaled Agile environment with 10+ teams which include development and shared services, using Jira, Confluence, SharePoint, or similar documentation and ticketing tools • Familiarity with the key components of the White House’s Zero Trust policy • Bachelor’s Degree in Computer Science, Cybersecurity or a related technical field • Familiarity with the Authority to Operate (ATO) policy which Information systems within government departments/agencies must comply with. Ideally, the candidate would have experience with a continuous ATO (cATO) process. • Support new business development opportunities at Maximus by lending IT security experience and expertise to proposals and past performance briefs #techjobs #clearance EEO Statement Active military service members, their spouses, and veteran candidates often embody the core competencies Maximus deems essential, and bring a resiliency and dependability that greatly enhances our workforce. We recognize your unique skills and experiences, and want to provide you with a career path that allows you to continue making a difference for our country. We’re proud of our connections to organizations dedicated to serving veterans and their families. If you are transitioning from military to civilian life, have prior service, are a retired veteran or a member of the National Guard or Reserves, or a spouse of an active military service member, we have challenging and rewarding career opportunities available for you. A committed and diverse workforce is our most important resource. Maximus is an Affirmative Action/Equal Opportunity Employer. Maximus provides equal employment opportunities to all qualified applicants without regard to race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status or disabled status. Pay Transparency Maximus compensation is based on various factors including but not limited to job location, a candidate's education, training, experience, expected quality and quantity of work, required travel (if any), external market and internal value analysis including seniority and merit systems, as well as internal pay alignment. Annual salary is just one component of Maximus's total compensation package. Other rewards may include short- and long-term incentives as well as program-specific awards. Additionally, Maximus provides a variety of benefits to employees, including health insurance coverage, life and disability insurance, a retirement savings plan, paid holidays and paid time off. Compensation ranges may differ based on contract value but will be commensurate with job duties and relevant work experience. An applicant's salary history will not be used in determining compensation. Maximus will comply with regulatory minimum wage rates and exempt salary thresholds in all instances. Minimum Salary $110,000.00 Maximum Salary $135,000.00"
    },
    {
        "index": 23,
        "description": "Position Overview At PNC, our people are our greatest differentiator and competitive advantage in the markets we serve. We are all united in delivering the best experience for our customers. We work together each day to foster an inclusive workplace culture where all our employees feel respected, valued and have an opportunity to contribute to the company’s success. As a Software Engineer Senior within PNC's Technology organization, you will be based in Pittsburgh, PA, Cleveland, OH, Birmingham, AL, or Dallas, TX. The position is primarily based in a PNC location. Responsibilities require time in the office or in the field on a regular basis. Some responsibilities may be performed remotely, at the manager’s discretion. This position may not be available in all geographic locations. **PNC will not provide sponsorship for employment visas or participate in STEM OPT for this position.** • Creating templates using a combination of rule development, javascript, and html • Doing source to target mapping of template fields to elements in an XSD schema • Generating URL payloads for sources and reviewing JSON objects Job Description Provides detailed technical design and development of software solutions using existing and emerging technology platforms. Proposes & designs software solutions to address complex business needs. Writes code, tests and deploys software. Prepares technical and procedural documentation required for software. Maintains and debugs software. PNC Employees take pride in our reputation and to continue building upon that we expect our employees to be: Customer Focused - Knowledgeable of the values and practices that align customer needs and satisfaction as primary considerations in all business decisions and able to leverage that information in creating customized customer solutions. Managing Risk - Assessing and effectively managing all of the risks associated with their business objectives and activities to ensure they adhere to and support PNC's Enterprise Risk Management Framework. Qualifications Successful candidates must demonstrate appropriate knowledge, skills, and abilities for a role. Listed below are skills, competencies, work experience, education, and required certifications/licensures needed to be successful in this position. Preferred Skills Application Development, Business Management, Customer Solutions, Design, Group Problem Solving, Process Improvements, Release Management, Software Solutions, User Experience (UX) DesignCompetencies Application Delivery Process, Application Design, Architecture, Application Development Tools, Application Testing, Packaged Application Integration, System Development Life Cycle, Technical Troubleshooting, Technical Writing/DocumentationWork Experience Roles at this level typically require a university / college degree, with 3+ years of relevant / direct industry experience. Certifications are often desired. In lieu of a degree, a comparable combination of education, job specific certification(s), and experience (including military service) may be considered.Education BachelorsCertifications No Required Certification(s)Licenses Candidates being considered for this position will be subject to additional background checks as established by the specific government client contract.Benefits PNC offers a comprehensive range of benefits to help meet your needs now and in the future. Depending on your eligibility, options for full-time employees include: medical/prescription drug coverage (with a Health Savings Account feature), dental and vision options; employee and spouse/child life insurance; short and long-term disability protection; 401(k) with PNC match, pension and stock purchase plans; dependent care reimbursement account; back-up child/elder care; adoption, surrogacy, and doula reimbursement; educational assistance, including select programs fully paid; a robust wellness program with financial incentives.In addition, PNC generally provides the following paid time off, depending on your eligibility: maternity and/or parental leave; up to 11 paid holidays each year; 8 occasional absence days each year, unless otherwise required by law; between 15 to 25 vacation days each year, depending on career level; and years of service. To learn more about these and other programs, including benefits for full time and part-time employees, visit Your PNC Total Rewards. Disability Accommodations Statement If an accommodation is required to participate in the application process, please contact us via email at ***************@pnc.com. Please include “accommodation request” in the subject line title and be sure to include your name, the job ID, and your preferred method of contact in the body of the email. Emails not related to accommodation requests will not receive responses. Applicants may also call 877-968-7762 and say \"Workday\" for accommodation assistance. All information provided will be kept confidential and will be used only to the extent required to provide needed reasonable accommodations. At PNC we foster an inclusive and accessible workplace. We provide reasonable accommodations to employment applicants and qualified individuals with a disability who need an accommodation to perform the essential functions of their positions. Equal Employment Opportunity (EEO) PNC provides equal employment opportunity to qualified persons regardless of race, color, sex, religion, national origin, age, sexual orientation, gender identity, disability, veteran status, or other categories protected by law. This position is subject to the requirements of Section 19 of the Federal Deposit Insurance Act (FDIA) and, for any registered role, the Secure and Fair Enforcement for Mortgage Licensing Act of 2008 (SAFE Act) and/or the Financial Industry Regulatory Authority (FINRA), which prohibit the hiring of individuals with certain criminal history. California Residents Refer to the California Consumer Privacy Act Privacy Notice to gain understanding of how PNC may use or disclose your personal information in our hiring practices."
    },
    {
        "index": 24,
        "description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better. We welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us! Job Description Rockwell Automation is looking for an innovative engineer to join our global embedded software organization based in Cleveland, Ohio. In this role, you will have the opportunity grow your career in embedded software by solving challenging problems using modern technologies, tools, and practices. You will report to the Team Lead, Embedded Software Key Responsibilities Develop safety- and security-critical embedded software for new Programmable Logic Controllers Work in a variety of hardware and software environments, ranging from commercial off-the-shelf to custom System on Chip architectures, and from general purpose to embedded real-time operating systems Use modern continuous integration and development tools, and promote continuous improvement of engineering tools and practices across the global development organization Participate as a member of an agile team within the Scaled Agile Framework, promoting Agile practices within the team Perform detailed-level design and implementation of controller features and subsystems with technical guidance from senior engineering personnel Participate in all aspects of the embedded software quality process, including design and code review, and developing unit and functional testware Implement automated tests; expand and improve automated test coverage, practices, and procedures The Essentials - You Will Have: Bachelor's Degree in a relevant field Legal authorization to work in the US is required. We will not sponsor individuals for employment visas, now or in the future, for this job opening. The Preferred - You Might Also Have: Bachelor's degree in Electrical Engineering or Computer Engineering or equivalent knowledge in the application of software engineering principles, theories, concepts, and techniques Typically requires 2+ years of software engineering experience in a professional setting. Experience developing software for embedded systems, especially using an embedded RTOS or Linux Experience debugging software systems using either an on-chip debugger, or a software based debugger such as GDB Experience developing automated tests and tools in a high level language such as Python Knowledge of industrial protocols, especially Common Industrial Protocol (CIP) Knowledge of communication protocols and technologies such as Ethernet, USB, or PCI Express Experience developing device drivers or other similar low-level embedded software Knowledge of modern Intel and ARM architectures Advanced coursework related to software engineering, embedded systems, operating systems, or computer architecture This position is part of a job family. Experience will be the determining factor for position level and compensation What We Offer: Health Insurance including Medical, Dental and Vision 401k Paid Time off Parental and Caregiver Leave Flexible Work Schedule where you will work with your manager to enjoy a work schedule that can be flexible with your personal life. To learn more about our benefits package, please visit at www.raquickfind.com. We are committed to equal employment opportunity regardless of race, color, ancestry, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender, gender identity or expression, or veteran status. We are proud to be an equal opportunity workplace. We are an Equal Opportunity Employer including disability and veterans. If you are an individual with a disability and you need assistance or a reasonable accommodation during the application process, please contact our services team at +1 (844) 404-7247. #LI-Hybrid #LI-PD1 #lifeatrok We are an Equal Opportunity Employer including disability and veterans. If you are an individual with a disability and you need assistance or a reasonable accommodation during the application process, please contact our services team at +1 (844) 404-7247. Rockwell Automation’s hybrid policy aligns that employees are expected to work at a Rockwell location at least Mondays, Tuesdays, and Thursdays unless they have a business obligation out of the office."
    },
    {
        "index": 25,
        "description": "Job#: 2066195 Job Description: Job Title: RPA Solutions Engineer Job Description: Job Brief: Collaborate directly with line of business partners to analyze business processes, determine improvement opportunities, and develop solutions using platforms, including but not limited to, Robotic Process Automation (RPA), Low Code, Process Mining, IDP and other technologies. Develop, configure, test, and implement processes to meet the defined requirements with high-quality builds on time and on budget. Essential Job Functions: Define requirements for new automation features and enhancements that are consistent with strategic priorities. Participates in the design process to ensure it supports business requirements and an optimized user experience. Owns the development, implementation, assessment, and support of one or more components of an environment, application, or platform. Thorough End to End testing of automated solutions Provides support, root cause analysis, and debugging for a specific automation or tool to meet SLA. Participates in the overall health, performance, and availability and actively works resolution of system and client experience impacts for one or more environments, applications, or platforms. Embraces mentorship and training from senior engineers. Communicate with broad, deep and diverse audiences, including peers, technology & business partners Provides continuous improvement ideas to reduce expenses and/or improve efficiency. Applies recommended information security standards when developing code and seeks to validate. Contributes to technical documentation, specifications, and project artifacts for developing code Identifies potential standards and best practices. Ensures compliance with CoE standards, security, risk, and change management Required Qualifications: Education/Certifications: Bachelor’s Degree and/or Technical Bootcamp or equivalent work experience required. Experience: Minimum 1-3 years of RPA using Automation Anywhere Software Development experience. Passion for technology and learning new tools and frameworks based upon project work. A self-starter who delivers high quality work and can adapt to new challenges, either on their own or as part of a team, working in a fast-paced environment Excellent planning and organization skills, with a commitment to delivering on aggressive deadlines. A strong desire to learn and develop problem solving skills. A basic understanding of quality assurance practices. Thank you, EEO Employer Apex Systems is an equal opportunity employer. We do not discriminate or allow discrimination on the basis of race, color, religion, creed, sex (including pregnancy, childbirth, breastfeeding, or related medical conditions), age, sexual orientation, gender identity, national origin, ancestry, citizenship, genetic information, registered domestic partner status, marital status, disability, status as a crime victim, protected veteran status, political affiliation, union membership, or any other characteristic protected by law. Apex will consider qualified applicants with criminal histories in a manner consistent with the requirements of applicable law. If you have visited our website in search of information on employment opportunities or to apply for a position, and you require an accommodation in using our website for a search or application, please contact our Employee Services Department at ***************@apexsystems.com or 844-463-6178. Apex Systems is a world-class IT services company that serves thousands of clients across the globe. When you join Apex, you become part of a team that values innovation, collaboration, and continuous learning. We offer quality career resources, training, certifications, development opportunities, and a comprehensive benefits package. Our commitment to excellence is reflected in many awards, including ClearlyRated's Best of Staffing® in Talent Satisfaction in the United States and Great Place to Work® in the United Kingdom and Mexico."
    },
    {
        "index": 26,
        "description": "At Cleveland Clinic, we are driven by a powerful mission to provide world-class care to as many people as possible. As we continue to innovate, AI plays a crucial role in shaping the future of healthcare, and we are looking for passionate, skilled professionals to join our AI team. The vision of our AI initiative is clear: to be the leader in leveraging artificial intelligence to provide the best healthcare in the world. By doing so at Cleveland Clinic, we aim to set a model that can be replicated globally, transforming healthcare as we know it. At Cleveland Clinic, we know what matters most, which is innovating for the future. AI scientists and engineers, this is your opportunity to apply cutting-edge AI technologies—such as deep learning, large language models, and agentic AI—to deliver impactful solutions that improve patient outcomes, caring for our caregivers, and drive operational efficiencies. We are building a remote team, located across the US, of machine learning engineers and scientists with a shared purpose for making healthcare smarter and more personalized. We are looking for individuals who are not just excited about AI, but who are also deeply motivated by the potential to change the way healthcare works on a global scale. If you want to work on projects that truly matter, Cleveland Clinic’s AI team offers the platform, culture, and mission to help you make a lasting impact on the future of healthcare. Ideal Candidate Traits Passionate about Healthcare: A genuine interest in healthcare and a commitment to using AI to improve patient outcomes and experiences. Curiosity: Willingness to dive into complex problems and explore new solutions in a rapidly evolving field. Adaptability: Comfort with navigating a health organization that focuses on improving patient care, rather than commercial product development. Collaboration: Strong team player who thrives in a collaborative, cross-disciplinary environment, working closely with clinicians, operational stakeholders, and external partners. Technical Expertise: Deep knowledge of AI, particularly in deep learning, generative AI, and large language models, with the ability to apply it to real-world healthcare problems. Innovative Mindset: Ability to think beyond traditional solutions and help shape the future of healthcare technology. Grit and Vision: Dedication to tackling the challenges of transforming an aging healthcare infrastructure with cutting-edge AI solutions. What You Can Expect in This Role Impactful Work: Contribute to the development and deployment of AI technologies that directly improve patient care and caregiver efficiency. Best in Class Innovation: Work with AI techniques such as deep learning, large language models, and generative AI to advance healthcare solutions. Collaborative Environment: Be part of a close-knit, supportive team where collaboration with clinical, operational, and external partners is key to driving success. Professional Growth: Engage in continuous learning and development as you work alongside top-tier experts in AI and healthcare. Mission-Driven Culture: Join an organization committed to improving the lives of patients and the future of healthcare worldwide. Leadership Development: Benefit from a leadership style that values autonomy, innovation, and personal growth, empowering you to reach your full potential. Ideal Candidate Skills: Strong programming skills in Python. Solid understanding of machine learning fundamentals and statistics. Practical experience in using AI frameworks and tools such as TensorFlow, PyTorch, Hugging Face, to build and tune foundation models Experience with cloud computing platforms (for ML/AI development) e.g. Azure, AWS, GCP and Databricks would be useful. And of course… experience in healthcare is also a plus. The Cleveland Clinic AI Vision: We believe in the transformative power of AI to revolutionize healthcare. By leveraging technology and vast clinical data, our AI team works to achieve personalized precision medicine, reduce non-clinical burdens for caregivers, and improve operational efficiency across the Cleveland Clinic network. In the next five years, we envision AI not just reshaping Cleveland Clinic, but also setting the stage for healthcare transformation globally. Our mission is to be the leader in responsibly using AI to improve healthcare, ultimately leading to better outcomes for patients and a brighter future for healthcare professionals everywhere. The Cleveland Clinic AI Culture: At Cleveland Clinic, the AI team thrives in a highly collaborative culture. Our leaders empower team members to innovate freely while ensuring alignment with our broader mission. We prioritize openness, curiosity, and flexibility, creating a space where professionals can contribute to meaningful projects while pursuing personal growth. Our culture supports shared learning across departments—especially with our IT and Analytics teams—ensuring that we are always at the forefront of technological advancement in healthcare."
    },
    {
        "index": 27,
        "description": "This position is responsible for the design, implementation and support of control system projects from their initial planning and conceptual stage through design, implementation, successful start-up, and acceptance by operating management. The design, implementation, and startup of these control systems involve the application of advanced computer/PLC/HMI programming, electrical controls knowledge, and process engineering skills. Knowledge of PLC hardware/software design and system integration is required. Here, we believe there’s not one path to success, we believe in careers that grow with you. Whoever you are or wherever you come from in the world, there’s a place for you at Sherwin-Williams. We provide you with the opportunity to explore your curiosity and drive us forward. Sherwin-Williams values the unique talents and abilities from all backgrounds and characteristics. All qualified individuals are encouraged to apply, including individuals with disabilities and Protected Veterans. We’ll give you the space to share your strengths and we want you show us what you can do. You can innovate, grow and discover in a place where you can thrive and Let Your Colors Show! At Sherwin-Williams, part of our mission is to help our employees and their families live healthier, save smarter and feel better. This starts with a wide range of world-class benefits designed for you. From retirement to health care, from total well-being to your daily commute—it matters to us. A general description of benefits offered can be found at http://www.myswbenefits.com/. Click on “Candidates” to view benefit offerings that you may be eligible for if you are hired as a Sherwin-Williams employee. Compensation decisions are dependent on the facts and circumstances of each position, which will impact where actual compensation may fall within the stated wage range. The wage range listed for this role takes into account the wide range of non-discriminatory factors considered in making compensation decisions including geographic location; skill sets; experience and training; licensure and certifications; and other business and organizational needs. The wage range, other compensation, and benefits information listed is accurate as of the date of this posting. The Company reserves the right to modify this information at any time, with or without notice, subject to applicable law. Qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable federal, state, and local laws including with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act where applicable. Sherwin-Williams is proud to be an Equal Employment Opportunity/Affirmative Action employer committed to an inclusive and diverse workplace. All qualified candidates will receive consideration for employment and will not be discriminated against based on race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age, pregnancy, genetic information, creed, marital status or any other consideration prohibited by law or by contract. As a VEVRAA Federal Contractor, Sherwin-Williams requests state and local employment services delivery systems to provide priority referral of Protected Veterans. Please be aware, Sherwin-Williams recruiting team members will never request a candidate to provide a payment, ask for financial information, or sensitive personal information like national identification numbers, date of birth, or bank account numbers during the application process. Direct responsibility with limited guidance to perform the following tasks: Design and implement new control systems for capital projects PLC programming and application development under direction of a Senior Control Engineer Enhance and support existing control systems. 24x7 support may be required for critical situations. Develop design specifications and user documentation for control system capital projects Coordinate the inputs of the project team (1-6 people from various departments) Budget responsibility on assigned projects (minor to $100k) Specify equipment, obtain cost estimates, generate bill of materials and expedite purchasing and fabrication of electrical controls equipment Lead contractors on project assignments Support control system commissioning through site acceptance Develops control system documentation and reference material for site operations and technical support personnel Drive continuous improvement through enhancements to existing control software and hardware systems Train and mentor various resources in controls/automation (interns/co-ops, external contractors, site engineers, instrument technicians) Provide technical support for root cause analysis related to control system issues and failures Job duties include contact with other employees and access confidential and proprietary information and/or other items of value, and such access may be supervised or unsupervised. The Company therefore has determined that a review of criminal history is necessary to protect the business and its operations and reputation and is necessary to protect the safety of the Company’s staff, employees, and business relationships. FORMAL EDUCATION: Required: BA or BS in Engineering or related field Preferred: BS in Chemical, Mechanical, Industrial, or Electrical Engineering KNOWLEDGE & EXPERIENCE: Required: 5 years’ experience in controls engineering or related field. Ability to demonstrate roles with increasing responsibility. Preferred: Concurrently leads multiple significant project design and execution; significant project defined as value of $100k or greater. Knowledge of chemical batch manufacturing processes Knowledge of ISA S88 standard for batch control Lean six sigma experience or belt certification TECHNICAL/SKILL REQUIREMENTS: Required: Proven Controls Engineering skills and results Knowledge of electrical systems including compliance with NEC and other applicable codes Compose Functional Specifications and approve corresponding vendor bids. AutoCAD, RsLogix 5000, RsFactoryTalk Studio Edition, MS Visio, MS Excel, MS Word, MS PowerPoint, MS Project Portfolio and project management. Preferred: Certified with Continuous Improvement tools; 6 Sigma, Lean, and Root Cause Analysis. Knowledge of industry RAGAGEP for industrial automation (ISA, IEC, PIP) Knowledge of OSHA Process Safety Management 1910.119 Manufacturing environment experience. TRAVEL REQUIREMENTS: (TIME SPENT AWAY FROM HOME OR OTHER TYPICAL OFFICE LOCATION) 20%"
    },
    {
        "index": 28,
        "description": "Senior Firmware Engineer (Onsite) Mayfield Heights, Ohio Only Full time JOB DETAIL: 1. Good experience of working in C and C++ in an embedded work environment or software application 2. 5+ years of software engineering experience with demonstrated professional development in software design and development 3. Ability to understand and apply knowledge of object-oriented analysis, design, and programming techniques, especially in C++ 4. Ability to direct the day-to-day technical activities of a small team of engineers 5. Previous experience working with real-time embedded development environments and ARM/Intel architecture Desired qualification: 1. Experience developing software to meet safety and security standards such as IEC 61508 or IEC 62443 2. Experience developing software using a scripting language such as Python 3. Knowledge of communication protocols and technologies such as SPI, UART, I2C, Ethernet, USB, or PCI Express 4. Experience using compilers and toolchains targeting ARM and Intel processors. 5. Ability to read traces, use an oscilloscope, review board schematics 6. Experience developing device drivers or other similar low-level embedded software 7. Knowledge of modern ARM and Intel architectures 8. Experience working with embedded Hypervisors and developing embedded software in a variety of software environments such as bare metal, embedded RTOS, or Linux 9. Knowledge of basic cryptography principles 10. Advanced coursework or degree related to software engineering, embedded systems, operating systems, or computer architecture sri nath"
    },
    {
        "index": 29,
        "description": "Sales and product service Sales Engineer - Cleveland, OH Sandvik Coromant in the Cleveland, Ohio region is looking for a Sales Engineer Location: Ideal location of the applicant would be in & around Northeast Ohio area If you are customer-focused and have a passion for excellence, with a background in the tooling & machining industry, Sandvik Coromant wants to speak with you about this exciting Cutting Tools Sales Engineer opportunity! *** Overnight Estimated Travel is expected to be around 10% depending on Business needs & situation. *** Key performance areas In this dynamic role, you will work as a commercial and technical expert supporting Customers to provide solutions and develop opportunities to meet our company’s sales growth goals. Main duties and responsibilities: The Sales Engineer will be providing ongoing support to our customer portfolio by consulting with customers to understand their needs and provide the ultimate customer experience by implementing the full Coromant offer. You will be accountable for ensuring that the development strategy aligns with the local business plan and is strengthening our market share. The Sales Engineer will fulfill and deliver expertise in relevant technical products and application solutions to Customers within the assigned territory. You will be responsible for ensuring Sandvik Coromant products are correctly implemented and deployed, competitor conversions are minimized, and help customers recognize the value of utilizing Sandvik Coromant tools and technology. Sales Territory Management Manages customer requests and business issues within a complex and global matrix organization, serving as a liaison between customers and company departments Builds strong customer relationships and secures customer commitment and service excellence through customers` pain points knowledge Supports Sales Management team by providing accurate forecasts, budgets and targets Ensures high quality and latest updates of data and information including case management, detailed Account Plans, Customer Value Plans, and sales activities in CRM (Dynamics) within assigned customer portfolio Develops local business plans to ensure market share increases/key product focus within the sales department are achieved in line with financial targets and KPI’s Executes global and local pricing strategies within all sales activities Ensures pre-meeting plans and preparations with customers to secure efficient negotiation results Maintains existing market shares and hunts for new business opportunities Promotes the competitive advantage of Sandvik Coromant products and advanced solutions, highlighting differentiating advantages the company’s Total Value Chain Offer Technical Competence Executes delivery of technical solutions and sales support to end-customers and distributors to grow share of wallet within territory and customer base Recommends products and services that fit well with customers’ business needs Troubleshoots, investigates, and resolves technical problems that arise Delivers training to educate external partners and customers on new product releases and features Documents applied products and services performance and cost savings results using Productivity Analyzer software Performs mathematical calculations applicable to product applications and sales statistics Way of working Builds effective working relationships with end customers and distributors to secure projects and opportunities to grow sales Ambassador for driving new ways of working and future technology within field of expertise to ensure customers’ needs are fulfilled and profitable business is gained Accountable to ensure successful opportunities are qualified and the appropriate products are applied in a first-class manner to maximize Sandvik Coromant’s market share and profitable business Listens to customers, technical experts, and sales project teams to understand underlying needs and ensure suitable tooling solutions are delivered to secure profitable business for Sandvik Coromant Leads customer projects from start to finish while coordinating with all internal stakeholders, partners, and customers Takes responsibility and control for the high-quality performance of the job duties Applies a structured and organized business orientated approach to daily work using the digital tools within Office 365 Displays broad technical knowledge of metal cutting tools knowledge and application experience Consistently improves knowledge of the Sandvik Coromant Offer and quality of production, new tools and technologies to increase professional development Regularly attends sales and product trainings, both independently and as defined by the company Your profile Five or more years’ experience in sales management with engineering cutting tools experience and technical knowledge Degree or equivalent qualification in mechanical/manufacturing engineering or related field Proven track record in delivering good business results Strong execution capabilities, able to create synergy, collaborate and gain commitment Experience managing external and internal customer relationships in accordance with commercial and technical terms and conditions Relevant experience from CAD/CAM and application knowledge is an advantage Project management knowledge is an advantage Skilled communicator, presenter, and negotiator in the English language, verbally and in writing Must possess a current driver’s license valid for his/her state of primary residence Applicant must be a US citizen or have eligible work permit Benefits Sandvik offers a comprehensive total compensation package including a competitive benefits package of health, dental and disability insurance, and a 401(k)-retirement savings plan. In addition, we provide opportunities for professional competence development and training, as well as opportunities for career advancement. Application For immediate consideration, please visit www.sandvik.com/careers Opens in new window to the Sales Engineer, Cleveland, OH position, Job # R0077167. SANDVIK COROMANT is the world’s leading supplier of tools, tooling solutions, and know-how to the manufacturing industry. Our customers, which include major manufacturers within aerospace, automotive, medical, energy and general engineering, rely on us to provide the highest level of knowledge, service, and support to help them achieve their goals for productivity and profitability. With extensive investments in research and development, we bring game-changing technologies and solutions to a dynamic industry driven by a demand for constant innovation. We have 8,000 employees and are represented in 130 countries, uniquely positioning us to set the industry standard for high technology manufacturing now and for the future. Sandvik Coromant is part of the business area Sandvik Machining Solutions within the 150-year-old global industrial group Sandvik. Sandvik Coromant is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. Any applicant who, because of a disability, needs accommodation or assistance in completing an application or at any time during the application process should contact Human Resources at ************@sandvik.com Sandvik also provides reasonable accommodations to employees with disabilities consistent with its obligations under the law. Apply Apply for this job"
    },
    {
        "index": 30,
        "description": "Sandvik Coromant in the Cleveland, Ohio region is looking for a Sales Engineer Location: Ideal location of the applicant would be in & around Northeast Ohio area If you are customer-focused and have a passion for excellence, with a background in the tooling & machining industry, Sandvik Coromant wants to speak with you about this exciting Cutting Tools Sales Engineer opportunity! *** Overnight Estimated Travel is expected to be around 10% depending on Business needs & situation. *** Key performance areas In this dynamic role, you will work as a commercial and technical expert supporting Customers to provide solutions and develop opportunities to meet our company’s sales growth goals. Main duties and responsibilities: The Sales Engineer will be providing ongoing support to our customer portfolio by consulting with customers to understand their needs and provide the ultimate customer experience by implementing the full Coromant offer. You will be accountable for ensuring that the development strategy aligns with the local business plan and is strengthening our market share. The Sales Engineer will fulfill and deliver expertise in relevant technical products and application solutions to Customers within the assigned territory. You will be responsible for ensuring Sandvik Coromant products are correctly implemented and deployed, competitor conversions are minimized, and help customers recognize the value of utilizing Sandvik Coromant tools and technology. Sales Territory Management Manages customer requests and business issues within a complex and global matrix organization, serving as a liaison between customers and company departments Builds strong customer relationships and secures customer commitment and service excellence through customers` pain points knowledge Supports Sales Management team by providing accurate forecasts, budgets and targets Ensures high quality and latest updates of data and information including case management, detailed Account Plans, Customer Value Plans, and sales activities in CRM (Dynamics) within assigned customer portfolio Develops local business plans to ensure market share increases/key product focus within the sales department are achieved in line with financial targets and KPI’s Executes global and local pricing strategies within all sales activities Ensures pre-meeting plans and preparations with customers to secure efficient negotiation results Maintains existing market shares and hunts for new business opportunities Promotes the competitive advantage of Sandvik Coromant products and advanced solutions, highlighting differentiating advantages the company’s Total Value Chain Offer Technical Competence Executes delivery of technical solutions and sales support to end-customers and distributors to grow share of wallet within territory and customer base Recommends products and services that fit well with customers’ business needs Troubleshoots, investigates, and resolves technical problems that arise Delivers training to educate external partners and customers on new product releases and features Documents applied products and services performance and cost savings results using Productivity Analyzer software Performs mathematical calculations applicable to product applications and sales statistics Way of working Builds effective working relationships with end customers and distributors to secure projects and opportunities to grow sales Ambassador for driving new ways of working and future technology within field of expertise to ensure customers’ needs are fulfilled and profitable business is gained Accountable to ensure successful opportunities are qualified and the appropriate products are applied in a first-class manner to maximize Sandvik Coromant’s market share and profitable business Listens to customers, technical experts, and sales project teams to understand underlying needs and ensure suitable tooling solutions are delivered to secure profitable business for Sandvik Coromant Leads customer projects from start to finish while coordinating with all internal stakeholders, partners, and customers Takes responsibility and control for the high-quality performance of the job duties Applies a structured and organized business orientated approach to daily work using the digital tools within Office 365 Displays broad technical knowledge of metal cutting tools knowledge and application experience Consistently improves knowledge of the Sandvik Coromant Offer and quality of production, new tools and technologies to increase professional development Regularly attends sales and product trainings, both independently and as defined by the company Your profile Five or more years’ experience in sales management with engineering cutting tools experience and technical knowledge Degree or equivalent qualification in mechanical/manufacturing engineering or related field Proven track record in delivering good business results Strong execution capabilities, able to create synergy, collaborate and gain commitment Experience managing external and internal customer relationships in accordance with commercial and technical terms and conditions Relevant experience from CAD/CAM and application knowledge is an advantage Project management knowledge is an advantage Skilled communicator, presenter, and negotiator in the English language, verbally and in writing Must possess a current driver’s license valid for his/her state of primary residence Applicant must be a US citizen or have eligible work permit Benefits Sandvik offers a comprehensive total compensation package including a competitive benefits package of health, dental and disability insurance, and a 401(k)-retirement savings plan. In addition, we provide opportunities for professional competence development and training, as well as opportunities for career advancement. Application For immediate consideration, please visit www.sandvik.com/careers to the Sales Engineer, Cleveland, OH position, Job # R0077167. SANDVIK COROMANT is the world’s leading supplier of tools, tooling solutions, and know-how to the manufacturing industry. Our customers, which include major manufacturers within aerospace, automotive, medical, energy and general engineering, rely on us to provide the highest level of knowledge, service, and support to help them achieve their goals for productivity and profitability. With extensive investments in research and development, we bring game-changing technologies and solutions to a dynamic industry driven by a demand for constant innovation. We have 8,000 employees and are represented in 130 countries, uniquely positioning us to set the industry standard for high technology manufacturing now and for the future. Sandvik Coromant is part of the business area Sandvik Machining Solutions within the 150-year-old global industrial group Sandvik. Sandvik Coromant is an equal opportunity/affirmative action employer. All qualified applicants will receive consideration for employment without regard to sex, gender identity, sexual orientation, race, color, religion, national origin, disability, protected Veteran status, age, or any other characteristic protected by law. Any applicant who, because of a disability, needs accommodation or assistance in completing an application or at any time during the application process should contact Human Resources at ************@sandvik.com Sandvik also provides reasonable accommodations to employees with disabilities consistent with its obligations under the law."
    },
    {
        "index": 31,
        "description": "Rockwell Automation is a global technology leader focused on helping the world’s manufacturers be more productive, sustainable, and agile. With more than 28,000 employees who make the world better every day, we know we have something special. Behind our customers - amazing companies that help feed the world, provide life-saving medicine on a global scale, and focus on clean water and green mobility - our people are energized problem solvers that take pride in how the work we do changes the world for the better. We welcome all makers, forward thinkers, and problem solvers who are looking for a place to do their best work. And if that’s you we would love to have you join us! Job Description You will report to the Team Lead Embedded software and have a hybrid schedule working in Mayfield Heights, Ohio. Your Responsibilities: Design and develop embedded software for Programmable Logic Controllers and Industrial PCs. Build and maintain automated tests in support of new and existing product features. Work in a variety of hardware and software environments, ranging from commercial off-the-shelf to custom System on Chip architectures, and from general purpose to embedded real-time operating systems. Use modern continuous integration and development tools, and promote continuous improvement of tools and practices across the global development organization. Demonstrate a strong understanding of object-oriented programming concepts, C++ and Python. Operate across the entire software development life cycle: requirements management, design, implementation, test, release, and maintenance. Work on an Agile development team within a larger Scaled Agile Framework (SAFe) organization, participating in short term (sprint), medium term (program increment) and long term (product roadmap) planning. Mentor less experienced personnel and encourage knowledge sharing and learning among the development community. The Essentials - You Will Have: Bachelor's Degree or Equivalent Years of Relevant Work Experience Legal authorization to work in the U.S. We will not sponsor individuals for employment visas, now or in the future, for this job opening. The Preferred - You Might Also Have: Bachelor's degree in Computer Engineering, Computer Science, Electrical Engineering or equivalent knowledge in the application of software engineering principles, theories, concepts, and techniques. This role typically requires a minimum 5+ years of software engineering experience with demonstrated professional development in software design and implementation. Ability to understand and apply knowledge of object-oriented analysis, design, and programming techniques. Experience developing embedded software in object-oriented languages such as C++. Experience developing automated tests and tools in high-level languages such as Python. In depth knowledge of software engineering and application of engineering principles and practices in a related field. Experience in requirements decomposition and test traceability. Experience in using open-source tools like Git and Jenkins. Knowledge of unit testing using tools like CppUnit, unittest, etc. Experience with continuous integration environments, automated test, and acceptance testing. Experience working in an Agile development setting and Agile project tools. Experience working with industrial protocols, especially Common Industrial Protocol (CIP) Experience developing software and test to safety and security standards such as IEC 61508 or IEC 62443. Advanced courses or degree in Engineering, Computer Science, or Controls. What We Offer: Health Insurance including Medical, Dental and Vision 401k Paid Time off Parental and Caregiver Leave Flexible Work Schedule where you will work with your manager to enjoy a work schedule that can be flexible with your personal life. To learn more about our benefits package, please visit at www.raquickfind.com. At Rockwell Automation we are dedicated to building a diverse, inclusive and authentic workplace, so if you're excited about this role but your experience doesn't align perfectly with every qualification in the job description, we encourage you to apply anyway. You may be just the right person for this or other roles. This position is part of a job family. Experience will be the determining factor for position level and compensation. #LI-Hybrid #LI-PD1 #lifeatrok We are an Equal Opportunity Employer including disability and veterans. If you are an individual with a disability and you need assistance or a reasonable accommodation during the application process, please contact our services team at +1 (844) 404-7247. Rockwell Automation’s hybrid policy aligns that employees are expected to work at a Rockwell location at least Mondays, Tuesdays, and Thursdays unless they have a business obligation out of the office."
    },
    {
        "index": 32,
        "description": "Principal Research Engineer – Urology Join the Cleveland Clinic team where you will work alongside passionate caregivers and provide patient-first healthcare. You will receive endless support and appreciation and build a rewarding career with one of the most respected healthcare organizations in the world. As a Principal Research Engineer, you will perform routine engineering investigations in support of current research or product development efforts using engineering software analysis tools, prepare design sketches or drawings, assist with the design, development, and evaluation of prototype medical devices and perform other duties. A caregiver in this position works from 8:00AM – 5:00PM. A caregiver who excels in this role will: Perform independent analysis, investigation, and planning of specific engineering criteria, characteristics and features to meet assignment goals. Assume responsibility for the planning, organizing, directing and coordinating of a wide variety of complex program initiatives. Conduct continuing studies and analyses to determine the feasibility of various advanced engineering approaches to define concepts and criteria for further programs or to resolve major problems in current programs. Resolve technical problems requiring the use of advanced theories, concepts and principles. Lead in the development of prototypes, medical devices, equipment or software. Assign components of the project initiatives to other engineers, technicians and designers and oversee the work. Collaborate with other engineers/investigators on major changes in project initiatives as they relate to other assignments, funds and priorities. Prepare cost estimates and monitor expenditures. Provide recommendations on the purchase of new equipment. Minimum qualifications for the ideal future caregiver include: Bachelor of Science in biomedical, mechanical or electrical engineering or a related field Six years of directly related experience A Master’s Degree and four years of experience may substitute the experience requirement Preferred qualifications for the ideal future caregiver include: Advanced degree Our caregivers continue to create the best outcomes for our patients across each of our facilities. Click the link and see how we’re dedicated to providing what matters most to you: https://jobs.clevelandclinic.org/benefits-2/ Physical Requirements: Perform work in a stationary position for extended periods Operate a computer and other office equipment Communicate and exchange accurate information Ability to distinguish color Manual dexterity to handle specimens and repair equipment Ability to lift and transport equipment or specimens weighing up to 20 pounds Possible exposure to hazardous chemicals, bio-hazards, radioactive materials, etc. Personal Protective Equipment: Follow standard precautions using personal protective equipment as required Pay Range Minimum hourly: $33.46 Maximum hourly: $51.03 The pay range displayed on this job posting reflects the anticipated range for new hires. While the pay range is displayed as an hourly rate, Cleveland Clinic recruiters will clarify whether the compensation is hourly or salary. A successful candidate’s actual compensation will be determined after taking factors into consideration such as the candidate’s work history, experience, skill set, and education. This is not inclusive of the value of Cleveland Clinic’s benefits package, which includes among other benefits, healthcare/dental/vision and retirement."
    },
    {
        "index": 33,
        "description": "Systems Engineer Network Location: Beachwood, OH. This is for a System Engineer Networking 50% of their time working on Data Center initiative and 50% of their time supporting our remote sites. Summary Statement: You will be working with a team of experts to develop, maintain and support Penske's cutting-edge network, storage, and server-based technologies. What You Will Be Doing: A System Engineer Network's main responsibility is to provide day-to-day support of the Company's wide area and local area networks. They support, monitor, and maintain network hardware and WAN connectivity to ensure maximum operability. The System Engineer Network is responsible to install and maintain remote locations networks. They manage and administrate the Company's DNS, Cisco and Aruba devices to ensure proper connectivity. The incumbent monitors network stability and performance; bring nonperforming sites to the attention of management. They participate in DR testing and maintain detailed documentation of the primary and redundant network infrastructure. A System Engineer Network will participate in multiple projects that have department or division-wide implications and impact. Such efforts will require cross-function involvement with IT groups and includes travel 5-10%. They are responsible for the creation of project plans, timelines, milestones, goals, and ownership. The position requires the ability to participate in afterhours tasks such as on-call responsibilities and organizational outage windows. Major Responsibilities: Technology: Management, maintenance, updating, and support of Company's WAN. Identification and correction of location network connectivity issues Understanding and execution of TCP/IP skills and IP address subnetting Manage traffic in and out of network hardware (routers) to ensure maximum utilization Project Management: Participate in the development and planning of projects. Identify and recommend solution to meet customer needs and implement chosen solution. Manage projects from identification of need to implementation and ongoing monitoring of system/solution performance. Analytics: Involved in analyzing system/software performance and adjust network specifications based on any identified problems Analyze network connectivity to ensure that hardware is utilized at its highest capacity Perform network analysis and disaster recovery planning and testing for the Company's WAN environment. Customer Experience: Communicate with client groups on a regular basis to determine needs Work closely with customer's leadership and project team during scope development and option analysis phase. Manage the projects and/or solutions to client group expectations Qualifications: Associates degree required, advanced degrees preferred Cisco (CCIE/CCNP/CCDA/CCDP) - preferred 3-5 years of functional experience 1-2 years of project management (including mid-to-large scale projects, and managing multiple projects at one time) Experience and full fluency in the following hardware/software (depending on role): Cisco tools (routers, switches) Solarwinds Network Management Tool MPLS Site to Site Site-to-Site VPN implementations Infoblox IPAM Management IP Addressing schemes. Bandwidth / Circuit monitoring tools. Microsoft office applications (including Visio) Router, Switch and IP configuration experience is required Wireless Infrastructure knowledge is preferred including but not limited to Autonomous and Lightweight Architectures, 3G/4G/5G, 802.1x and other security conscious implementations including VPN solutions. -Regular, predictable, full attendance is an essential function of the job. -Willingness to work the required schedule, work at the specific location required, travel as necessary, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required. Physical Requirements: The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The associate will be required to: read; communicate verbally and/or in written form; remember and analyze certain information; and remember and understand certain instructions or guidelines. While performing the duties of this job, the associate may be required to stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to occasionally lift and/or move up to 25lbs/12kg. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus. Penske is an Equal Opportunity Employer. About Penske Logistics Penske Logistics engineers state-of-the-art transportation, warehousing and freight management solutions that deliver powerful business results for market-leading companies. With operations in North America, South America, Europe and Asia, Penske and its associates help businesses move forward by increasing visibility and driving down supply-chain costs. Visit Penske Logistics to learn more. Job Category: Information Technology Job Family: Information Technology Address: 3000 Auburn Dr Primary Location: US-OH-Beachwood Employer: Penske Logistics LLC Req ID:"
    },
    {
        "index": 34,
        "description": "Systems Engineer Network Location: Beachwood, OH. This is for a System Engineer Networking 50% of their time working on Data Center initiative and 50% of their time supporting our remote sites. Summary Statement: You will be working with a team of experts to develop, maintain and support Penske's cutting-edge network, storage, and server-based technologies. What You Will Be Doing: A System Engineer Network's main responsibility is to provide day-to-day support of the Company's wide area and local area networks. They support, monitor, and maintain network hardware and WAN connectivity to ensure maximum operability. The System Engineer Network is responsible to install and maintain remote locations networks. They manage and administrate the Company's DNS, Cisco and Aruba devices to ensure proper connectivity. The incumbent monitors network stability and performance; bring nonperforming sites to the attention of management. They participate in DR testing and maintain detailed documentation of the primary and redundant network infrastructure. A System Engineer Network will participate in multiple projects that have department or division-wide implications and impact. Such efforts will require cross-function involvement with IT groups and includes travel 5-10%. They are responsible for the creation of project plans, timelines, milestones, goals, and ownership. The position requires the ability to participate in afterhours tasks such as on-call responsibilities and organizational outage windows. Major Responsibilities: Technology: Management, maintenance, updating, and support of Company's WAN. Identification and correction of location network connectivity issues Understanding and execution of TCP/IP skills and IP address subnetting Manage traffic in and out of network hardware (routers) to ensure maximum utilization Project Management: Participate in the development and planning of projects. Identify and recommend solution to meet customer needs and implement chosen solution. Manage projects from identification of need to implementation and ongoing monitoring of system/solution performance. Analytics: Involved in analyzing system/software performance and adjust network specifications based on any identified problems Analyze network connectivity to ensure that hardware is utilized at its highest capacity Perform network analysis and disaster recovery planning and testing for the Company's WAN environment. Customer Experience: Communicate with client groups on a regular basis to determine needs Work closely with customer's leadership and project team during scope development and option analysis phase. Manage the projects and/or solutions to client group expectations Qualifications: Associates degree required, advanced degrees preferred Cisco (CCIE/CCNP/CCDA/CCDP) preferred 3-5 years of functional experience 1-2 years of project management (including mid-to-large scale projects, and managing multiple projects at one time) Experience and full fluency in the following hardware/software (depending on role): Cisco tools (routers, switches) Solarwinds Network Management Tool MPLS Site to Site Site-to-Site VPN implementations Infoblox IPAM Management IP Addressing schemes. Bandwidth / Circuit monitoring tools. Microsoft office applications (including Visio) Router, Switch and IP configuration experience is required Wireless Infrastructure knowledge is preferred including but not limited to Autonomous and Lightweight Architectures, 3G/4G/5G, 802.1x and other security conscious implementations including VPN solutions. Regular, predictable, full attendance is an essential function of the job. Willingness to work the required schedule, work at the specific location required, travel as necessary, complete Penske employment application, submit to a background investigation (to include past employment, education, and criminal history) and drug screening are required. Physical Requirements: The physical and mental demands described here are representative of those that must be met by an associate to successfully perform the essential functions of this job. Reasonable accommodations may be made to enable individuals with disabilities to perform the essential functions. The associate will be required to: read; communicate verbally and/or in written form; remember and analyze certain information; and remember and understand certain instructions or guidelines. While performing the duties of this job, the associate may be required to stand, walk, and sit. The associate is frequently required to use hands to touch, handle, and feel, and to reach with hands and arms. The associate must be able to occasionally lift and/or move up to 25lbs/12kg. Specific vision abilities required by this job include close vision, distance vision, peripheral vision, depth perception and the ability to adjust focus. Penske is an Equal Opportunity Employer. About Penske Logistics Penske Logistics engineers state-of-the-art transportation, warehousing and freight management solutions that deliver powerful business results for market-leading companies. With operations in North America, South America, Europe and Asia, Penske and its associates help businesses move forward by increasing visibility and driving down supply-chain costs. Visit Penske Logistics to learn more. Job Category: Information Technology Job Family: Information Technology Address: 3000 Auburn Dr Primary Location: US-OH-Beachwood Employer: Penske Logistics LLC Req ID: Date posted: 03/15/2025"
    },
    {
        "index": 35,
        "description": "9860 York Alpha Dr , North Royalton, OH 44133 CNC Programmer / Machinist Cutting Edge Projects with Top Tier Technology Positive, Family-friendly Work Culture & Great Benefits 1st Shift, Overtime Opportunities Available Join the Future of Aerospace Manufacturing at Lunar Tool & Mold! Lunar Tool & Mold , a second-generation precision manufacturing firm at the forefront of Ohio's aerospace industry, is HIRING NOW for a CNC Programmer/ Machinist with 3-5+ years of experience to join our elite team. Operating since 1965, we bring nearly six decades of expertise in designing, engineering, machining, and manufacturing high-precision tools and molds for defense contractors and aerospace firms across the United States. Our state-of-the-art facility in North Royalton, OH, is equipped with top-tier technology, including Southwest/Bridgeport Bed and Knee mills, Makino EDMs, and cutting-edge CNC tooling from Makino, Mitsubishi, and Hwacheon. As a CNC Programmer/Machinist, you will play a key role in crafting high-precision components, programming advanced CNC machines, and ensuring the tooling we produce meets the strict standards demanded by our global aerospace clientele. You'll work with state-of-the-art CAD/CAM software, collaborate with top engineers, and contribute to some of the most innovative projects in the industry. At Lunar Tool & Mold, we don't just invest in state-of-the-art equipment-we invest in our people. We foster a positive, team-oriented environment where your skills are valued, and your contributions are celebrated. From recognition events to team outings, we believe a happy, motivated workforce leads to superior craftsmanship. If you're ready to elevate your career in a workplace that values precision, teamwork, and innovation, we want to hear from you! We Offer: Competitive Compensation based on experience Level 1: $27-$35 per hour Level 2: $30-$45 per hour Work Schedule: Full-time, 1st shift, Monday to Friday, with overtime opportunities available. Bonuses and Profit Sharing: Annual bonus payout and participation in our Profit-Sharing Program. Comprehensive Benefits: Full family medical, dental, and vision insurance; short- and long-term disability insurance; life insurance. Retirement Plan: 401(k) with company match. Additional Perks: Flexible Spending Account, paid vacation, holidays, and sick time. Professional Development: Access to training programs to support your growth-We invest in your success! Innovative Environment: Exciting projects and challenges at the forefront of aerospace innovation. Modern Facility: We continuously reinvest in top-tier machinery, prioritizing quality above all else. We also offer video or phone interviews to accommodate out-of-town applicants. Responsibilities-CNC Programmer/ Machinist: Precision CNC Programming & Machining: Develop and execute highly accurate 3D tool paths using NX CAD/CAM software Blueprint Interpretation: Read and interpret blueprints to maintain tolerances of +/- 0.001\" Collaboration with Engineers & Machinists: Provide input on tooling design, ensuring feasibility and efficiency in manufacturing CNC Setup & Operation: Configure and operate CNC machines, including Fadal, Mitsubishi, Fanuc, Makino, and other systems Quality Assurance: Analyze Blue Light Inspection reports to ensure tooling meets exact specifications Process Standardization: Utilize internal documentation and templates to streamline CNC programming Project Management & Coordination: Delegate machining tasks to ensure on-time project completion Continuous Improvement: Identify and implement efficiency and quality enhancements Qualifications-CNC Programmer/ Machinist: 1+ years of experience creating 3D tool paths (high-precision aerospace environment preferred) 3-5+ years of experience programming and machining complex components CAD/CAM Proficiency: Experience with NX, CATIA, AutoCAD, SolidWorks, or other professional CAD/CAM software Education: High School Diploma, GED, or equivalent Ability to set up CNC tooling and machine blocks Strong understanding of CNC control systems (Fadal, Mitsubishi, Fanuc, Makino, etc.) Familiarity with common tool room equipment (mills, lathes, grinders, drill presses) Skilled in precision measurement tools (calipers, indicators, depth mics) Siemens NX Experience Computer Skills: Above-average computer literacy and proficiency with common computer products such as Microsoft Office Strong time management and independent work mindset Excellent communication skills to coordinate with engineers and machinists Mechanical aptitude with an emphasis on accuracy and efficiency Please upload your resume and complete the online assessment for immediate consideration. Candidates must pass pre-employment screening. We are an Equal Opportunity Employer. All qualified applicants will receive consideration for employment regardless of race, color, religion, age, sex, national origin, disability status, genetics, protected veteran status, sexual orientation, gender identity or expression, or any other characteristic protected by federal, state or local laws."
    },
    {
        "index": 36,
        "description": "At EY, you’ll have the chance to build a career as unique as you are, with the global scale, support, inclusive culture and technology to become the best version of you. And we’re counting on your unique voice and perspective to help EY become even better. Join us and build an exceptional experience for yourself, and a better working world for all. The exceptional EY experience. It's yours to build. EY focuses on high-ethical standards and integrity among its employees and expects all candidates to demonstrate these qualities. EY is seeking a motivated professional with solid experience in the industrials, energy or utilities sector to serve as a Senior AI Data Engineer who possesses a robust background in AI, Gen AI, Agentic AI, preferably with an electrical engineering background. The ideal candidate will have a history of working for consulting companies and be well-versed in the fast-paced culture of consulting work. This role is dedicated to the industrials, energy, and utilities sector, where the successful candidate will craft, deploy, and maintain large-scale AI data architectures. The opportunity As a Senior Data Engineer, you will be at the forefront of designing and implementing analytics solutions that drive substantial business value. You'll work closely with a diverse group of stakeholders to translate complex business requirements into precise technical specifications. Your role is crucial in bridging the gap between business needs and technical solutions, ensuring the successful execution of data-driven projects. Your Key Responsibilities In this role, you will design, develop, and maintain scalable data architectures, both on-premises and in the cloud. You'll manage the efficient storage, integration, validation, and security of data throughout its lifecycle. Your contributions will be vital to the delivery of processes, solutions, or projects, requiring you to exercise judgment and select appropriate methodologies to inform recommendations. You will be responsible for meeting your own targets, which will impact the performance of your team, and may guide junior colleagues to achieve project deliverables. Design and implement scalable data architectures Ensure efficient data lifecycle management Contribute to the delivery of key projects and solutions Architect and refine AI data architecture and modern data pipelines, integrating agentic AI solutions for clients in the industrials, energy, or power and utility sectors. Leveraging your knowledge of industrials, energy or power and utility systems and processes to define data requirements, gather, profile and analyze large scale structured and unstructured source data, and develop AI/GenAI/Agentic AI solutions Develop the mechanisms to ingest, analyze, validate, normalize, and clean data to support standardization, customization and ad hoc data analysis needs Evaluate and implement cutting-edge tools and methodologies to enhance data engineering productivity. Collaborate with a diverse team of business analysts, solution architects, and data scientists to develop strategic enterprise solutions and data products. Skills And Attributes For SuccessTo excel in this role, you should demonstrate expertise in cloud computing, data architecture design, data integration, and software engineering. Your ability to manage relationships, think critically, and adapt with emotional agility will be key to your success. A deep understanding of the value chain and core processes within the energy, or power systems sectors. Proficiency in AI, GenAI/Agentic AI, relational SQL databases, DevOps, continuous integration, and data lake concepts. A proven ability to design and maintain complex data integrations and ETL pipelines. Strong organizational skills, capable of leading projects across globally distributed teams. Exceptional communication skills and the ability to troubleshoot complex data issues. Collaborate with stakeholders to define technical specifications Participate in client sessions and lead workstream teams Manage resource plans, budgets, and project statuses To qualify for the role, you must haveA Bachelor’s degree in electrical/Power Systems Engineering, AI, Computer Science, Data Science, or a related field. At least 5 years of experience in data engineering, AI, and analytics. At least 5 years of experience in the power and utilities sector. A track record of implementing complex data solutions and familiarity with cloud services, data engineering programming languages, and data architecture. Demonstrated understanding and experience using: AI, GenAI/Agentic AI Relational SQL databases DevOps and continuous integration Microsoft Fabric, Databricks/Snowflake GitHub Experience in cloud computing, data architecture design, data integration, and software engineering Professional certifications as defined by service line policies Relationship management skills Critical thinking and emotional agility Ideally, you’ll also have Proven ability to navigate complex issues and make informed decisions Experience in supervising and guiding junior team members Demonstrated participation in sales opportunities and RFP responses Leadership experience with a focus on team development and mentorship. A passion for leveraging emerging technologies to address real-world problems. A commitment to creating an inclusive work environment that celebrates diversity. What We Look ForWe seek top performers with a keen eye for detail, a passion for data-driven solutions, and the ability to thrive in a collaborative environment. Your proactive approach to problem-solving, combined with your technical expertise, will set you apart as a candidate. FY25NATAID What We Offer We offer a comprehensive compensation and benefits package where you’ll be rewarded based on your performance and recognized for the value you bring to the business. The base salary range for this job in all geographic locations in the US is $105,100 to $192,700. The salary range for New York City Metro Area, Washington State and California (excluding Sacramento) is $126,100 to $218,900. Individual salaries within those ranges are determined through a wide variety of factors including but not limited to education, experience, knowledge, skills and geography. In addition, our Total Rewards package includes medical and dental coverage, pension and 401(k) plans, and a wide range of paid time off options. Join us in our team-led and leader-enabled hybrid model. Our expectation is for most people in external, client serving roles to work together in person 40-60% of the time over the course of an engagement, project or year. Under our flexible vacation policy, you’ll decide how much vacation time you need based on your own personal circumstances. You’ll also be granted time off for designated EY Paid Holidays, Winter/Summer breaks, Personal/Family Care, and other leaves of absence when needed to support your physical, financial, and emotional well-being. Continuous learning: You’ll develop the mindset and skills to navigate whatever comes next. Success as defined by you: We’ll provide the tools and flexibility, so you can make a meaningful impact, your way. Transformative leadership: We’ll give you the insights, coaching and confidence to be the leader the world needs. Diverse and inclusive culture: You’ll be embraced for who you are and empowered to use your voice to help others find theirs. EY accepts applications for this position on an on-going basis. If you can demonstrate that you meet the criteria above, please contact us as soon as possible.EY exists to build a better working world, helping to create long-term value for clients, people and society and build trust in the capital markets. Enabled by data and technology, diverse EY teams in over 150 countries provide trust through assurance and help clients grow, transform and operate. Working across assurance, consulting, law, strategy, tax and transactions, EY teams ask better questions to find new answers for the complex issues facing our world today. For those living in California, please click here for additional information. EY is an equal opportunity, affirmative action employer providing equal employment opportunities to applicants and employees without regard to race, color, religion, age, sex, sexual orientation, gender identity/expression, pregnancy, genetic information, national origin, protected veteran status, disability status, or any other legally protected basis, including arrest and conviction records, in accordance with applicable law. EY is committed to providing reasonable accommodation to qualified individuals with disabilities including veterans with disabilities. If you have a disability and either need assistance applying online or need to request an accommodation during any part of the application process, please call 1-800-EY-HELP3, select Option 2 for candidate related inquiries, then select Option 1 for candidate queries and finally select Option 2 for candidates with an inquiry which will route you to EY’s Talent Shared Services Team (TSS) or email the TSS at ***************@ey.com"
    },
    {
        "index": 37,
        "description": "Here, we believe there’s not one path to success, we believe in careers that grow with you. Whoever you are or wherever you come from in the world, there’s a place for you at Sherwin-Williams. We provide you with the opportunity to explore your curiosity and drive us forward. Sherwin-Williams values the unique talents and abilities from all backgrounds and characteristics. All qualified individuals are encouraged to apply, including individuals with disabilities and Protected Veterans. We’ll give you the space to share your strengths and we want you show us what you can do. You can innovate, grow and discover in a place where you can thrive and Let Your Colors Show! At Sherwin-Williams, part of our mission is to help our employees and their families live healthier, save smarter and feel better. This starts with a wide range of world-class benefits designed for you. From retirement to health care, from total well-being to your daily commute—it matters to us. A general description of benefits offered can be found at http://www.myswbenefits.com/. Click on “Candidates” to view benefit offerings that you may be eligible for if you are hired as a Sherwin-Williams employee. Compensation decisions are dependent on the facts and circumstances of each position, which will impact where actual compensation may fall within the stated wage range. The wage range listed for this role takes into account the wide range of non-discriminatory factors considered in making compensation decisions including geographic location; skill sets; experience and training; licensure and certifications; and other business and organizational needs. The wage range, other compensation, and benefits information listed is accurate as of the date of this posting. The Company reserves the right to modify this information at any time, with or without notice, subject to applicable law. Qualified applicants with arrest or conviction records will be considered for employment in accordance with applicable federal, state, and local laws including with the Los Angeles County Fair Chance Ordinance for Employers and the California Fair Chance Act where applicable. Sherwin-Williams is proud to be an Equal Employment Opportunity/Affirmative Action employer committed to an inclusive and diverse workplace. All qualified candidates will receive consideration for employment and will not be discriminated against based on race, color, religion, sex, sexual orientation, gender identity, national origin, protected veteran status, disability, age, pregnancy, genetic information, creed, marital status or any other consideration prohibited by law or by contract. As a VEVRAA Federal Contractor, Sherwin-Williams requests state and local employment services delivery systems to provide priority referral of Protected Veterans. Please be aware, Sherwin-Williams recruiting team members will never request a candidate to provide a payment, ask for financial information, or sensitive personal information like national identification numbers, date of birth, or bank account numbers during the application process. Core Responsibilities and Task: Manage and contribute to the engineering and construction efforts for store facilities, ensuring timely and budget-conscious project completion. Oversee direct reports, collaborate with various teams, and handle complex engineering challenges. Team Management: Manage, train, and review the performance of direct reports. Legal and Budget Assistance: Assist with resolving legal issues, budget concerns, and lease negotiations involving store facilities. Status Reporting: Maintain and collaborate on the Construction and Installations Status Report, providing necessary data to the Director of Construction for financial and timeline oversight. Productivity Improvements: Pursue productivity improvements within the Engineering team. Engineering Plans: Create site-specific engineering plans/drawings and coordinate new store and remodel construction timelines with contractors, vendors, and internal installation crews. Conflict Resolution: Resolve code and physical conflicts involving existing stores and construction projects. Policy Adherence: Uphold Engineering/Installation Department procedures and policies. On-Site Oversight: Frequently visit new store construction and larger remodel projects to ensure timely, on-budget progress and follow-up on punch lists. Collaboration: Work closely with construction/installations teams, store services, vendors, leasing, and stakeholders to ensure proper construction completion dates and project budgeting. Coordinate with Installations for timeline adjustments. Review Sets: Promptly review Architectural and MEP sets for accuracy in collaboration with installations. Software Utilization: Use various related software to ensure project success. Work with leasing on leases, negotiations, timing, and lease/amendment exhibits. Budget Estimates: Provide prompt and accurate budget estimates for the leasing team and conduct detailed RFP processes for projects where Sherwin-Williams is performing the build-out. Reporting: Regularly report project timeline milestones and budget impacts. Peer Support: Provide formal and informal peer support for collaborative learning. Relationship Building: Create relationships with District Leadership teams in respective regions. Hold monthly construction status update meetings with district teams during new store/remodel projects and ancillary repair escalations. Customer Service: Exceed internal customer communication and service expectations. Landlord Repairs: Handle landlord repair escalations, including sending professionally written certified letters to landlords. Engineering Problem-Solving: Solve complex engineering problems involving Civil, Fire, Architectural, MEP, and Structural components. Inquiries Management: Direct Tax, CAM, and Insurance inquiries to the leasing/admin team(s). Job duties include contact with other employees and access confidential and proprietary information and/or other items of value, and such access may be supervised or unsupervised. The Company therefore has determined that a review of criminal history is necessary to protect the business and its operations and reputation and is necessary to protect the safety of the Company’s staff, employees, and business relationships. FORMAL EDUCATION: Required: Bachelor’s Degree in Architecture, Engineering or Construction Management or 8 year of related Real Estate, Construction/Engineering experience. Valid driver’s license Preferred: Master’s Degree in Architecture, Engineering or Construction Management KNOWLEDGE & EXPERIENCE: Required: Prior experience in construction industry, ideally with retail facilities. Organizational and planning skills and the ability to establish priorities and handle many projects simultaneously in a fast-paced environment. Good written and verbal communication skills, with the ability to interact and collaborate with all levels of management, contractor, government official and landlords/property owners. M365 Suite of Applications TECHNICAL/SKILL REQUIREMENTS: Required: Generation of store designs and estimates within an acceptable time frame. Creation of new design concepts and specification for site specific and proto-typical stores. Motivation and development of staff in the face of increased demand for services. Resolution of conflicts arising from code/legal issues and /or physical constraints or stores. AutoCAD & Revit Construction acumen TRAVEL REQUIREMENTS: (TIME SPENT AWAY FROM HOME OR OTHER TYPICAL OFFICE LOCATION) 30%"
    },
    {
        "index": 38,
        "description": "8 Necessary cookies help make a website usable by enabling basic functions like page navigation and access to secure areas of the website. The website cannot function properly without these cookies. Cookiebot1Learn more about this provider CookieConsentStores the user's cookie consent state for the current domain Maximum Storage Duration: 1 yearType: HTTP Cookie Google3Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. test_cookieUsed to check if the user's browser supports cookies. Maximum Storage Duration: 1 dayType: HTTP Cookie rc::aThis cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. Maximum Storage Duration: PersistentType: HTML Local Storage rc::cThis cookie is used to distinguish between humans and bots. Maximum Storage Duration: SessionType: HTML Local Storage LinkedIn1Learn more about this provider li_gcStores the user's cookie consent state for the current domain Maximum Storage Duration: 180 daysType: HTTP Cookie beacon-v2.helpscout.net1 hs-beacon-#-#-#-#-#-shown-animationPending Maximum Storage Duration: PersistentType: HTML Local Storage oilandgasjobsearch.com2 browserIDRegisters a unique ID that identifies the user's device for return visits. Maximum Storage Duration: 400 daysType: HTTP Cookie SESS#Preserves users states across page requests. Maximum Storage Duration: 1 dayType: HTTP Cookie 1 Preference cookies enable a website to remember information that changes the way the website behaves or looks, like your preferred language or the region that you are in. LinkedIn1Learn more about this provider lidcRegisters which server-cluster is serving the visitor. This is used in context with load balancing, in order to optimize user experience. Maximum Storage Duration: 1 dayType: HTTP Cookie 5 Statistic cookies help website owners to understand how visitors interact with websites by collecting and reporting information anonymously. Google2Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. _gaRegisters a unique ID that is used to generate statistical data on how the visitor uses the website. Maximum Storage Duration: 2 yearsType: HTTP Cookie _ga_#Used by Google Analytics to collect data on the number of times a user has visited the website as well as dates for the first and most recent visit. Maximum Storage Duration: 2 yearsType: HTTP Cookie Hotjar2Learn more about this provider _hjSession_#Collects statistics on the visitor's visits to the website, such as the number of visits, average time spent on the website and what pages have been read. Maximum Storage Duration: 1 dayType: HTTP Cookie _hjSessionUser_#Collects statistics on the visitor's visits to the website, such as the number of visits, average time spent on the website and what pages have been read. Maximum Storage Duration: 1 yearType: HTTP Cookie oilandgasjobsearch.com1 sentryReplaySessionRegisters data on visitors' website-behaviour. This is used for internal analysis and website optimization. Maximum Storage Duration: SessionType: HTML Local Storage 7 Marketing cookies are used to track visitors across websites. Meta Platforms, Inc.3Learn more about this provider lastExternalReferrerDetects how the user reached the website by registering their last URL-address. Maximum Storage Duration: PersistentType: HTML Local Storage lastExternalReferrerTimeDetects how the user reached the website by registering their last URL-address. Maximum Storage Duration: PersistentType: HTML Local Storage _fbpUsed by Facebook to deliver a series of advertisement products such as real time bidding from third party advertisers. Maximum Storage Duration: 3 monthsType: HTTP Cookie Google3Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. IDEUsed by Google DoubleClick to register and report the website user's actions after viewing or clicking one of the advertiser's ads with the purpose of measuring the efficacy of an ad and to present targeted ads to the user. Maximum Storage Duration: 400 daysType: HTTP Cookie pagead/1p-user-list/#Tracks if the user has shown interest in specific products or events across multiple websites and detects how the user navigates between sites. This is used for measurement of advertisement efforts and facilitates payment of referral-fees between websites. Maximum Storage Duration: SessionType: Pixel Tracker _gcl_auUsed by Google AdSense for experimenting with advertisement efficiency across websites using their services. Maximum Storage Duration: 3 monthsType: HTTP Cookie LinkedIn1Learn more about this provider bcookieUsed in order to detect spam and improve the website's security. Maximum Storage Duration: 1 yearType: HTTP Cookie Unclassified 11 Unclassified cookies are cookies that we are in the process of classifying, together with the providers of individual cookies. Appcast2Learn more about this provider cc_utPending Maximum Storage Duration: 1 yearType: HTTP Cookie generic-te8/a31.pngPending Maximum Storage Duration: SessionType: Pixel Tracker Customer.io3Learn more about this provider _cioPending Maximum Storage Duration: 1 dayType: HTTP Cookie _cioanonidPending Maximum Storage Duration: 1 yearType: HTTP Cookie events/page.gifPending Maximum Storage Duration: SessionType: Pixel Tracker Google1Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. _aimwel_sessionPending Maximum Storage Duration: SessionType: HTTP Cookie karieragroup.t2.aimwel.com1 (unnamed)Pending Maximum Storage Duration: SessionType: Pixel Tracker oilandgasjobsearch.com3 jwtPending Maximum Storage Duration: SessionType: HTTP Cookie maze-usPending Maximum Storage Duration: SessionType: HTML Local Storage rdbTokenPending Maximum Storage Duration: SessionType: HTTP Cookie snippet.maze.co1 maze:widgetsPending Maximum Storage Duration: SessionType: HTML Local Storage"
    },
    {
        "index": 39,
        "description": "Delve Underground is a leader in underground and heavy civil engineering serving the transportation, water, wastewater, and energy industries. Specializing in tunnel design, we provide practical solutions to the most challenging underground problems. We offer comprehensive design, construction management, and construction claims services, with expertise extending across a wide range of engineering disciplines, including civil, structural, and geotechnical engineering. Our primary focus is to make a significant impact on the advancement of infrastructure projects, which in turn shape and enhance the communities we serve. Founded in 1954, as Jacobs Associates, Delve Underground is an employee-owned firm with 25 offices and 350 team members throughout the United States, Canada, Australia, and New Zealand. We want our employees to make a career doing what they love to do. We encourage an entrepreneurial spirit and help our team members forge their own path within the company. We support their efforts to stay on the cutting edge of technology while fostering a great work-life balance. In addition to working hard, we also have fun. We socialize and celebrate achievements at summer picnics, holiday parties, and company outings. Benefits: Full Benefits Program consisting of Medical, Dental, Vision, Life, Disability, FSA or HSA, EAP, 401(k), ESOP, and company stock ownership program, 9 Paid Holidays, generous paid-time-off program, Work from home flexibility, and Health & Wellness Reimbursement Pay Rate: $84,564 - $153,330 Staff Engineer Delve Underground has an immediate opening for a Staff Engineer to join our Cleveland team. This position focuses on supporting the design of tunnels, underground facilities, and water infrastructure projects. This position offers a great opportunity for a motivated, detail oriented, team-centric candidate to work on diverse jobs, from local pipeline crossings to water & wastewater mega-projects across the country. The ideal candidate will have either academic or prior work experience in one or more of the following areas: geotechnical or geological engineering, excavation support, rock mechanics or trenchless technologies. Responsibilities: Perform engineering analyses and design for tunnels, shafts, foundations, temporary excavation support systems, and soil/rock slopes under the direction of senior engineers Assist with cost estimation and construction scheduling under the direction of senior engineers Write technical reports and other documents explaining the basis for analyses, designs or recommendations Assist with the preparation of construction drawings and specifications for underground infrastructure Work as an integral member of a team on complex, multi-disciplined projects. Demonstrate good writing and communications skills and ability to communicate with internal staff and clients. Work on a variety of office and field assignments Qualifications: BS in Civil Engineering, Geological Engineering, or Construction Management Completion of relevant coursework or experience in several of the following: geotechnical engineering, soil and rock mechanics, foundation engineering, water resources, project management, reinforced concrete and steel structural analysis and design Experience with analytical and design technology software such as excel, MathCAD, python, Civil3D, REVIT, OpenGround and Microstation is a plus Experience or coursework with cost estimating and scheduling is a plus Ability to manage concurrent assignments and priorities Strong analytical and technical communication skills Willingness to work in the field and travel for short-term assignments Fundamentals of Engineering (FE) certification or the ability to obtain one within 1 year ARE YOU READY TO JOIN OUR TEAM? If you feel that you are right for this position, please fill out our initial application so that we can review your information. We look forward to meeting you! Delve Underground is an EEO/Affirmative Action Employer and will make all employment related decisions without regard to race, color, religion, sex, national origin, disability or protected veteran status. Compensation reflects the cost of labor across our US geographic markets. Pay is based on several factors including market location, experience, knowledge, and skills. No recruiters."
    },
    {
        "index": 40,
        "description": "Delve Underground is a leader in underground and heavy civil engineering serving the transportation, water, wastewater, and energy industries. Specializing in tunnel design, we provide practical solutions to the most challenging underground problems. We offer comprehensive design, construction management, and construction claims services, with expertise extending across a wide range of engineering disciplines, including civil, structural, and geotechnical engineering. Our primary focus is to make a significant impact on the advancement of infrastructure projects, which in turn shape and enhance the communities we serve. Founded in 1954, as Jacobs Associates, Delve Underground is an employee-owned firm with 25 offices and 350 team members throughout the United States, Canada, Australia, and New Zealand. We want our employees to make a career doing what they love to do. We encourage an entrepreneurial spirit and help our team members forge their own path within the company. We support their efforts to stay on the cutting edge of technology while fostering a great work-life balance. In addition to working hard, we also have fun. We socialize and celebrate achievements at summer picnics, holiday parties, and company outings. Pay Rate: $25 - $28 /hour Civil Engineer Intern Delve Underground has a summer internship opening for a Civil Engineer Intern to join our Cleveland team. This position focuses on supporting the delivery of tunnels, underground facilities, and wastewater infrastructure projects. This position offers a great opportunity for a motivated, detail oriented, team-centric candidate to work on diverse jobs and gain experience, from local pipeline crossings to water & wastewater mega-projects across the country. The ideal candidate will have either academic or prior work experience in one or more of the following areas: geotechnical engineering, civil engineering, structural engineering, civil engineering design technology and drawings, engineering project management. Responsibilities: Assist with engineering analyses and design for tunnels, shafts, foundations, temporary excavation support systems, and soil/rock slopes under the direction of senior engineers Assist with cost estimation and construction scheduling under the direction of senior engineers Assist with writing technical reports and other documents explaining the basis for analyses, designs or recommendations Assist with the preparation of construction drawings and specifications for underground infrastructure Work as an integral member of a team on complex, multi-discipline projects. Demonstrate good writing and communications skills and ability to communicate with internal staff and clients. Work on a variety of office and field assignments Qualifications: Current student or BS Civil Engineering, Geological Engineering, or Construction Management. Completion of relevant coursework or experience in several of the following: statics, dynamics, mechanics of materials, geotechnical engineering, fluid mechanics, project management, surveying, hydraulic engineering, water resources, foundation engineering, reinforced concrete and steel structural analysis and design Experience with design technology software such as Civil3D, REVIT, OpenGround and Microstation is a plus Ability to manage a number of concurrent assignments and priorities Strong analytical and technical communication skills Willingness to work in the field and travel for short-term assignments ARE YOU READY TO JOIN OUR TEAM? If you feel that you would be right for this position, please fill out our initial application so that we can review your information. We look forward to meeting you! Delve Underground is an EEO/Affirmative Action Employer and will make all employment related decisions without regard to race, color, religion, sex, national origin, disability or protected veteran status. Compensation reflects the cost of labor across our US geographic markets. Pay is based on several factors including market location, experience, knowledge, and skills. No recruiters."
    },
    {
        "index": 41,
        "description": "8 Necessary cookies help make a website usable by enabling basic functions like page navigation and access to secure areas of the website. The website cannot function properly without these cookies. Cookiebot1Learn more about this provider CookieConsentStores the user's cookie consent state for the current domain Maximum Storage Duration: 1 yearType: HTTP Cookie Google3Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. test_cookieUsed to check if the user's browser supports cookies. Maximum Storage Duration: 1 dayType: HTTP Cookie rc::aThis cookie is used to distinguish between humans and bots. This is beneficial for the website, in order to make valid reports on the use of their website. Maximum Storage Duration: PersistentType: HTML Local Storage rc::cThis cookie is used to distinguish between humans and bots. Maximum Storage Duration: SessionType: HTML Local Storage LinkedIn1Learn more about this provider li_gcStores the user's cookie consent state for the current domain Maximum Storage Duration: 180 daysType: HTTP Cookie beacon-v2.helpscout.net1 hs-beacon-#-#-#-#-#-shown-animationPending Maximum Storage Duration: PersistentType: HTML Local Storage oilandgasjobsearch.com2 browserIDRegisters a unique ID that identifies the user's device for return visits. Maximum Storage Duration: 400 daysType: HTTP Cookie SESS#Preserves users states across page requests. Maximum Storage Duration: 1 dayType: HTTP Cookie 1 Preference cookies enable a website to remember information that changes the way the website behaves or looks, like your preferred language or the region that you are in. LinkedIn1Learn more about this provider lidcRegisters which server-cluster is serving the visitor. This is used in context with load balancing, in order to optimize user experience. Maximum Storage Duration: 1 dayType: HTTP Cookie 5 Statistic cookies help website owners to understand how visitors interact with websites by collecting and reporting information anonymously. Google2Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. _gaRegisters a unique ID that is used to generate statistical data on how the visitor uses the website. Maximum Storage Duration: 2 yearsType: HTTP Cookie _ga_#Used by Google Analytics to collect data on the number of times a user has visited the website as well as dates for the first and most recent visit. Maximum Storage Duration: 2 yearsType: HTTP Cookie Hotjar2Learn more about this provider _hjSession_#Collects statistics on the visitor's visits to the website, such as the number of visits, average time spent on the website and what pages have been read. Maximum Storage Duration: 1 dayType: HTTP Cookie _hjSessionUser_#Collects statistics on the visitor's visits to the website, such as the number of visits, average time spent on the website and what pages have been read. Maximum Storage Duration: 1 yearType: HTTP Cookie oilandgasjobsearch.com1 sentryReplaySessionRegisters data on visitors' website-behaviour. This is used for internal analysis and website optimization. Maximum Storage Duration: SessionType: HTML Local Storage 7 Marketing cookies are used to track visitors across websites. Meta Platforms, Inc.3Learn more about this provider lastExternalReferrerDetects how the user reached the website by registering their last URL-address. Maximum Storage Duration: PersistentType: HTML Local Storage lastExternalReferrerTimeDetects how the user reached the website by registering their last URL-address. Maximum Storage Duration: PersistentType: HTML Local Storage _fbpUsed by Facebook to deliver a series of advertisement products such as real time bidding from third party advertisers. Maximum Storage Duration: 3 monthsType: HTTP Cookie Google3Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. IDEUsed by Google DoubleClick to register and report the website user's actions after viewing or clicking one of the advertiser's ads with the purpose of measuring the efficacy of an ad and to present targeted ads to the user. Maximum Storage Duration: 400 daysType: HTTP Cookie pagead/1p-user-list/#Tracks if the user has shown interest in specific products or events across multiple websites and detects how the user navigates between sites. This is used for measurement of advertisement efforts and facilitates payment of referral-fees between websites. Maximum Storage Duration: SessionType: Pixel Tracker _gcl_auUsed by Google AdSense for experimenting with advertisement efficiency across websites using their services. Maximum Storage Duration: 3 monthsType: HTTP Cookie LinkedIn1Learn more about this provider bcookieUsed in order to detect spam and improve the website's security. Maximum Storage Duration: 1 yearType: HTTP Cookie Unclassified 11 Unclassified cookies are cookies that we are in the process of classifying, together with the providers of individual cookies. Appcast2Learn more about this provider cc_utPending Maximum Storage Duration: 1 yearType: HTTP Cookie generic-te8/a31.pngPending Maximum Storage Duration: SessionType: Pixel Tracker Customer.io3Learn more about this provider _cioPending Maximum Storage Duration: 1 dayType: HTTP Cookie _cioanonidPending Maximum Storage Duration: 1 yearType: HTTP Cookie events/page.gifPending Maximum Storage Duration: SessionType: Pixel Tracker Google1Learn more about this provider Some of the data collected by this provider is for the purposes of personalization and measuring advertising effectiveness. _aimwel_sessionPending Maximum Storage Duration: SessionType: HTTP Cookie karieragroup.t2.aimwel.com1 (unnamed)Pending Maximum Storage Duration: SessionType: Pixel Tracker oilandgasjobsearch.com3 jwtPending Maximum Storage Duration: SessionType: HTTP Cookie maze-usPending Maximum Storage Duration: SessionType: HTML Local Storage rdbTokenPending Maximum Storage Duration: SessionType: HTTP Cookie snippet.maze.co1 maze:widgetsPending Maximum Storage Duration: SessionType: HTML Local Storage"
    },
    {
        "index": 42,
        "description": "Imperial Electric, A Nidec Company, is a custom manufacturer of special application AC and DC motor systems for the elevator/escalator, commercial floor care, and other markets. With more than 100 years of industry experience, Imperial Electric offers a complete line of products including permanent magnet motors, gear motors, AC and DC elevator motors, AC induction motors, generator sets, wheel drives, gear boxes, and gearing. Imperial Electric is a Nidec Company. Learn more about Imperial Electric and Nidec at www.imperialelectric.com and www.nidec.com Sales Account Manager Sales Position for field sales, sales development, and working with new and existing customers in the Elevator Industry. Arrange and hold customer meetings, quote follow ups of written quotes for AC/DC Motors, Gearless Machines and Hydraulic motors in the Elevator Industry. Determination of products is required to meet the customer requirements especially for Modernization Projects. Customer account responsibility, some travel to customer locations and several industry trade shows per year. Excellent verbal and written technical skills required. Duties: Consult with external customers including specifying, consulting engineers and elevator contractors, interpreting customer requirements and providing product application assistance via phone and e-mail. Prepare and follow up on quotations from established pricing strategies. Provide timely and accurate information to customers on the proper application and installation of Imperial Electric Machines and Motors Position reports to the Vice President of Sales and Marketing Requirements: Bachelor’s degree, preferably in Engineering or Business, or equivalent work experience preferably in Electrical or Mechanical Engineering, or recent college graduates with an aptitude for sales. Excellent oral, technical writing and presentation skills General computer software skills including MS Office, AutoCAD, and Salesforce Ability to plan, organize, and manage sales contacts and quotes. Some travel is required Elevator Industry a plus Training will be provided."
    },
    {
        "index": 43,
        "description": "Must have HVAC experience. The core activities include system engineering, drafting and validation of control system wiring for all automation aspects related to mechanical HVAC system installations. Throughout the project, the Design Engineer must be responsible for maintaining coordination with the project team to manage the design schedule and validity of all published control system wiring schematics. DUTIES/RESPONSIBILITIES:  Responsible for producing all control system wiring schematics and documentation.  Generates project bill of material and develops actuator/valve schedules.  Responsible for documenting, monitoring and maintaining control system design standards and processes that increase project profitability.  Interface regularly with project team, customers and vendors.  Support field commissioning of control system and document validity of design intent.  Make adjustments to the drawings, calculations and specifications as required on the project.  Be fluent in documentation practices for the given industry and capable of generating Standard Operating Procedures for the given systems.  Utilize knowledge of engineering practices, mathematics, computer programming, materials and other physical sciences to complete the drawings with minimal supervision.  Maintain familiarity with project scope and budget. QUALIFICATIONS:  5-10 years of experience in HVAC automation systems design.  Bachelor degree in engineering or extensive HVAC automation system design background.  Proficient in AutoCAD.  Proficient in a wide variety of control sensor and meter technologies.  Proficient in Microsoft based software (Outlook, Word, Excel, Project)  Driver's license and reliable transportation $85,000.00 - $100,000.00"
    },
    {
        "index": 44,
        "description": "Overview Responsible for administering AmTrust’s global firewall and network infrastructure in order to meet business objectives. This position will have a primary role in supporting the enterprise firewall infrastructure and intrusion detection system by implementing security controls which safeguard enterprise applications and data. Responsibilities · Knowledgeable on network topologies and routing protocols · Administers and supports overall firewall architecture for the enterprise · Creates diagrams, high level and low level, of firewalls in the data center and DMZ · Implements various security protections and best practices with network security tools to protect the corporation · Identifies possible risk points and recommends solutions for the firewall infrastructure · Performs analysis and auditing for requests that are submitted in order to allow/deny access requests while adhering to corporate security standards · Performs URL Filtering, Network IPS/IDS Signature tuning while maintaining platform-specific security baselines · When necessary, works with Security team to respond to information system security incidents, including investigation of, countermeasures to, and recovery from computer-based attacks, unauthorized access, and policy breaches · Keeps current on network security risks and trends · Provide off-hours support on an infrequent, but as needed basis · Establish and maintain a strong working relationship with all team members · Maintain and update relevant system and process documentation and develop ad-hoc reports as needed Qualifications · Bachelor’s degree from an accredited college or university · Knowledge and experience with firewall administration, IPS, IDS, URL Filtering, network security, remote access, site-to-site VPN, IPSEC & SSL VPN, remote authentication software, external DNS and internet proxy · At Least 3 years of experience with network firewall software · Experience with Palo Alto and F5 suite of products is preferred · Experience with OSPF and BGP routing protocols · Knowledge of electronic data transmission principles, LAN networks, routing fundamentals, business applications, DMZ design and troubleshooting techniques is essential · Demonstrated ability to interpret and analyze data and make an informed, calculated risk decisions · Respect for confidential and security information · Excellent organizational and time management skills #LI-MM1 #LI-HYBRID #AmTrust What We Offer AmTrust Financial Services offers a competitive compensation package and excellent career advancement opportunities. Our benefits include: Medical & Dental Plans, Life Insurance, including eligible spouses & children, Health Care Flexible Spending, Dependent Care, 401k Savings Plans, Paid Time Off. AmTrust strives to create a diverse and inclusive culture where thoughts and ideas of all employees are appreciated and respected. This concept encompasses but is not limited to human differences with regard to race, ethnicity, gender, sexual orientation, culture, religion or disabilities. AmTrust values excellence and recognizes that by embracing the diverse backgrounds, skills, and perspectives of its workforce, it will sustain a competitive advantage and remain an employer of choice. Diversity is a business imperative, enabling us to attract, retain and develop the best talent available. We see diversity as more than just policies and practices. It is an integral part of who we are as a company, how we operate and how we see our future. Connect With Us! Not ready to apply? Connect with us for general consideration."
    },
    {
        "index": 45,
        "description": "Primary Responsibilities: --Maintain station equipment through preventive maintenance and repair. --Installation, wiring and documentation for broadcast equipment, IT servers, switches, routers. --Assist News Dept with support for systems such as BitCentral, ENPS, Ross Xpression. --Perform diagnostics and repair of computer systems. Hardware repair or software installs. --Operate or assist with transmission of bonded cellular, satellite or RF microwave truck. --Have basic understanding of technical drawings and documents. --Ability to interface with outside vendors for repairs or upgrades on systems Requirements: --Minimum 3-5 years experience with IT, electronics, television environment or similar. --Ability to troubleshoot-repair-operate broadcast equipment including video monitoring, routers, patch panels, fiber, wireless devices, ENG cameras and studio robotic cameras. --Use of audio-video-data test equipment such as digital waveform-spectrum analyzer. --Demonstrated IT experience with basic server, networking topology and operating systems. --Ability to work with management team on design, installation and integration of new equipment. --Excellent communication and critical thinking skills, ability to prioritize issues. --Good hand dexterity, ability to climb ladders, work in tight spots, lift minimum 50 lbs. --Amateur radio operator, FCC license, SBE/Cisco/Microsoft certifications all a plus."
    },
    {
        "index": 46,
        "description": "Must have HVAC experience. Up to 25% TRAVEL. Must have construction experience. Must have 4 year college degree. The Electrical Engineer will be responsible for the engineering and design of electrical systems for assigned projects. Specifically, this position will utilize knowledge and skills in the engineering and design of HVAC and plumbing projects. This position will identify and provide solutions to electrical design problems and will initiate conceptual designs subject to the review and approval of the Electrical Engineer Team Lead, Engineering Manager, and Preconstruction Manager. DUTIES/RESPONSIBILITIES: • Responsible for assisting in all aspects of the electrical design of the project assigned • Report to the team lead electrical engineer regarding scheduling requirements • Create construction drawings, perform calculations, and write specifications as required by the team lead electrical engineer • Must be familiar with the project’s scope of work, engineering hours budget, and construction budget • Assist in developing and maintaining drafting, design, and engineering standards • Utilize knowledge of engineering practices, mathematics, materials, and other physical sciences to complete the drawings with minimal supervision • Collaborate with project teams to monitor and meet milestones of the project schedule • Perform site surveys and equipment assessments • Provide project engineering coordination during construction as assigned • Serve in a support role on projects as directed by the team lead electrical engineer • Assist in developing accurate preliminary design solutions for prospective complex projects within an expedited timeframe • Interact with project stakeholders, contractors, and third-party associates to develop and maintain productive working relationships. Bachelor of Science degree in Engineering (Electrical, Mechatronics, or other Technology degrees). • Electrical engineering experience with a professional engineering firm, or electrical contractor engaged in MEP related or similar work, preferred; internships and co-op experience in electrical engineering, electrical design, MEP, or similar work will also be considered. • Driver’s license and reliable transportation. • Willingness to travel to worksites, up to 25% KNOWLEDGE, SKILLS & ABILITIES • Understanding of electrical and construction means, and methods associated with the renovation of commercial and institutional buildings and/or similar facilities • Proficiency with systems design (i.e. Fire Alarm, TeleCom, Security, etc.) • Proficient user of Microsoft office suite; highly proficient use of Excel and other software used in the construction industry • Familiarity with project management software (e.g. Procore, Bluebeam Revu) • Proficient user of AutoCAD/Revit Design software • Excellent mathematic skills in order to perform the duties of this role, review or prepare budgets and other job-related documents, and to effectively perform the role of an electrical engineer $100,000.00 - $130,000.00"
    },
    {
        "index": 47,
        "description": "MRI Software is seeking a Sales Engineering Intern to join our team for the summer! A Sales Engineering intern needs to balance technical know-how with communication and interpersonal skills to effectively support sales engineers and support us in demonstrating products to potential customers. Here are the basic skills required: 1. Technical Knowledge Basic understanding of technology: Familiarity with supporting/organizing meetings remotely as well as the ability to organize thoughts around the concept of solving problems Problem-solving skills: Ability to diagnose and resolve basic technical issues. Programming or technical tools: Basic Scripting or object-oriented programming a plus, but not required. Data entry – familiar with creating basic data visuals 2. Communication Skills Clear explanation of technical concepts: Ability to simplify technical ideas for non-technical customers. Active listening: Understanding client needs to provide tailored solutions. Presentation skills: Comfort with product demos, webinars, or other sales presentations.’ This role will not be client facing, but will help organize internal meetings to stakeholders in the business as if they are customers 3. Customer Service Skills Empathy and patience: Desire to understanding pain points and addressing them effectively. Responsiveness: Following up on inquiries and ensuring customers feel heard and supported. This role will work with the team to organize client feedback and assist with reporting critical data used for decision making. 4. Sales Skills Persuasion and influence: Desire to help potential see the value of your product. Team collaboration: Working effectively with sales engineers to prepare for optimal messaging. 5. Eagerness to Learn Adaptability: Quickly learning about the product, industry, and customer challenges. Curiosity: Will utilize our AI tools to extra trends and update the department heads as needed. 6. Soft Skills Teamwork: Collaborating with diverse teams, including sales, marketing, and product development. Proactive attitude: Taking initiative and being resourceful in identifying solutions. Willing to work alongside a candid group in an organize hierarchy Professionalism: Representing the team in a polished and respectful manner. Other Requirements: We understand the need to provide a flexible working environment partnered with team collaboration and socialization. Therefore, we operate a hybrid working model with 2 days of working from home per week (3 days working in office). This role is based out of our global Headquarters in Solon, OH. We’re obsessed with making this the best internship you’ve ever had! Here is what you can expect: Comprehensive internship program offering hands-on corporate working experience and professional development opportunities along the way! Full time, paid employment- our internship runs from the end of May to beginning of August. Opportunity to work with direct leaders and employees as well as other interns! At MRI, our company culture is more than a talking point – it’s what makes us shine! We value your hard work and encourage you to be your whole self while you do it. Passion, integrity, and inclusion mixed with a healthy dose of fun is what makes us the best fit for your next career move! MRI continues to strive to amaze as a global industry leader in real estate software. Whether you are joining as a new pride member or bringing your expertise back, your talent is important to maintaining MRI’s high client experience standard and continuing our growth in the PropTech space. Amazing growth takes amazing employees. Are you up to the challenge? MRI Software is an Equal Opportunity Employer. Regardless of your race, color, religion, sex, national origin, sexual orientation, gender identity, disability, age, veteran status, you are welcome here."
    },
    {
        "index": 48,
        "description": "**Company Description** **Work with Us. Change the World.** At AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations. There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of over 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world. We're one global team driven by our common purpose to deliver a better world. Join us. **Job Description** **AECOM** has a position available for an mid-career **Civil/Structural Engineer** to support our growing Energy Business Line. This position may be located at any one of AECOM's multiple Energy offices in the United States. Our team provides a wide range of civil and structural engineering services across markets sectors including electrical transmission and distribution (OH/UG power systems, substations, EV charging networks, microgrid design, etc.), renewables (Solar PV, Battery Energy Storage Systems, Wind), industrial process (Oil & Gas, petrochemical), building decarbonization and next generation energy (hydrogen, fuel cells, electrolyzers, etc.). We are looking for an enthusiastic individual to develop within and further the technical skills we bring to our new and existing client base. Qualified candidates will have a familiarity with civil and structural design aspects for heavy industrial clients. The responsibilities of this role also include, but may not be limited to, the following: + Perform engineering analyses and design and proposes approaches to solve challenges encountered + Provides mentorship/guidance to entry level engineers + Performs work in accordance with agreed upon budgets and schedule with little supervision + Provide engineering support for multi-discipline design projects from work scope development until the completion of construction + Evaluate and apply applicable building code requirements and design code requirements (e.g. IBC, ASCE, ACI, AISC) + Travel to project site and meetings as needed. + Uses computer software as a tool for solving structural engineering problems including building 3D analytical structural models + Assist with productions of drawing and documents + Develop technical specifications, plans, and details + Occasional travel to client/project sites **At AECOM, we’re delivering a better world.** We believe infrastructure creates opportunity for everyone. Whether it’s improving your commute, keeping the lights on, providing access to clean water or transforming skylines, our work helps people and communities thrive. Our clients trust us to bring together the best people, ideas, technical expertise and digital solutions to our work in transportation, buildings, water, the environment and new energy. We’re one global team – +50,000 strong – driven by a common purpose to deliver a better world. **Qualifications** **Minimum Requirements** + Bachelor’s degree in Civil or Structural Engineering + 4 years of relevant industrial experience or demonstrated equivalency of experience and/or education. **Preferred Qualifications** + 6+ years of experience + PE licensure + Demonstrated experience of structural steel design and reinforced concrete design + Knowledgeable in design/building codes such as the AISC Manual of Steel Construction, ACI 318, International Building Code, and ASCE 7 (Design Loads and Associated Criteria for Buildings and Other Structures). + Knowledge and experience with computer productivity software such as Microsoft Office (Outlook, Word, Excel, etc.) + Proficient in structural analysis software such as STAAD Pro + Experience with civil drainage and sitework design + Knowledge and skill with AutoCAD 3D software + Enthusiastic, hard-working, technically proficient, with ambition and drive **Additional Information** + Relocation assistance is not available for this role + Sponsorship for US Employment Authorization is available for this position Offered compensation will be based on location and individual qualifications. The expected range is $95,000.00 - $125,000.00. **About AECOM** AECOM is proud to offer comprehensive benefits to meet the diverse needs of our employees. Depending on your employment status, AECOM benefits may include medical, dental, vision, life, AD&D, disability benefits, paid time off, leaves of absences, voluntary benefits, perks, well-being resources, employee assistance program, business travel insurance, service recognition awards, retirement savings plan, and employee stock purchase plan. AECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $14.4 billion in fiscal year 2023. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM. **Freedom to Grow in a World of Opportunity** You will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed. You will help us foster a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients. AECOM provides a wide array of compensation, benefits and well-being programs to meet the diverse needs of our employees and their families. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too. Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours. All your information will be kept confidential according to EEO guidelines. **ReqID:** J10124158 **Business Line:** Energy **Business Group:** DCS **Strategic Business Unit:** East **Career Area:** Engineering **Work Location Model:** Hybrid **Legal Entity:** AECOM Technical Services Inc"
    },
    {
        "index": 49,
        "description": "**Company Description** **Work with Us. Change the World.** At AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations. There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of over 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world. We're one global team driven by our common purpose to deliver a better world. Join us. **Job Description** AECOM has an opening for an experienced Electrical Engineer to be based in Orange, CA; Denver, CO; Columbus, OH or Cleveland, OH. The Electrical Engineer will join a multidisciplinary, collaborative team with a range of expertise supporting the expansion of their knowledge base with the ability to travel and gain field experience. As part of our team, you will support a diverse tapestry of work across markets like Commercial, Federal (Military/DoD), Healthcare, Higher Education, Sports + Rec and Science + Tech markets, including landmark projects in the industry. You will have opportunities to take on complex challenges and pioneer innovative solutions from strategy and design through project realization. Join a practice filled with professionals pioneering Energy Conservation and Zero Carbon initiatives, focusing on renewable energy projects for high-performance buildings. Contribute to decarbonization and electrification efforts while enjoying focused growth opportunities in sustainable practices and skills enhancement training centric to AECOM's Sustainable Legacy. About Buildings + Places: Our Buildings + Places practice includes architecture, interiors, building and system engineering, urbanism, and planning (inclusive of landscape design), strategy +, economics, technology solutions, asset advisory, and cost and program management. This diverse team assists our clients from strategy through project realization, creating positive outcomes for those who occupy and use the buildings and environments we help to create. Our practice focuses on the Commercial/Corporate, Science and Technology, Higher Education and Federal market sectors. We look to combine beauty, sustainability, resiliency, equity, and innovation in our projects and believe these values can be instilled in any project regardless of size or budget. Job Summary/Responsibilities + Electrical engineering support from conceptual design through construction administration and post-occupancy + Performs specific and moderate portions of a broader assignment of an experienced engineer. + Gathers and correlates basic engineering data using established and well-defined procedures. + Support in the review of shop drawings during the construction administration phase + Prepare engineering related calculations and develop drawings and visual aids + Write reports and memos for internal and external purposes based on findings + Works cooperatively with managers and other employees to achieve company's mission + Ensures discipline plans that are created meet overall project team requirements for project scope, quality and schedule + Stays current on codes and technologies appropriate to the electrical disciplines + Support on site visits for the purpose of data collection and evaluation of electrical systems, equipment, components and materials for projects + Develops designs within a BIM design environment + Completes assigned engineering and design tasks in accordance with client specified criteria and applicable codes and standards **Qualifications** Minimum Requirements + BA/BS in Electrical Engineering, Architectural Engineering or similar +2 years of related experience or demonstrated equivalency of experience and/or education. Preferred Qualifications + Bachelors degree from an ABET accredited University and has passed the fundamentals of Engineering Exam (EIT/FE) + Experience with Revit and AutoCAD based design projects + 3+ years of electrical engineering experience within a consulting or design-build firm + Strong communication skills: articulate, assertive, and confident + Creative thinker with effective teamwork skills + Desire to be mentored by leadership. + Experience with sustainable design + Strong attention to detail and accuracy/quality of work. + Proficient in the use of drafting software including Revit and AutoCAD + Capable of using spreadsheet, word processing and standard Microsoft software. + Ability to work with and collaborate with a multi-disciplinary team **Additional Information** + Hybrid work environment – Fully remote position not available. Offered compensation will be based on location and individual qualifications. The expected range is $75,000.00 - $90,000.00. **About AECOM** AECOM is proud to offer comprehensive benefits to meet the diverse needs of our employees. Depending on your employment status, AECOM benefits may include medical, dental, vision, life, AD&D, disability benefits, paid time off, leaves of absences, voluntary benefits, perks, well-being resources, employee assistance program, business travel insurance, service recognition awards, retirement savings plan, and employee stock purchase plan. AECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $14.4 billion in fiscal year 2023. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM. **Freedom to Grow in a World of Opportunity** You will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed. You will help us foster a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients. AECOM provides a wide array of compensation, benefits and well-being programs to meet the diverse needs of our employees and their families. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too. Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours. All your information will be kept confidential according to EEO guidelines. **ReqID:** J10124278 **Business Line:** B&P - Buildings & Places **Business Group:** DCS **Strategic Business Unit:** West **Career Area:** Engineering **Work Location Model:** Hybrid **Legal Entity:** AECOM Technical Services Inc"
    },
    {
        "index": 50,
        "description": "**Company Description** **Work with Us. Change the World.** At AECOM, we're delivering a better world. Whether improving your commute, keeping the lights on, providing access to clean water, or transforming skylines, our work helps people and communities thrive. We are the world's trusted infrastructure consulting firm, partnering with clients to solve the world’s most complex challenges and build legacies for future generations. There has never been a better time to be at AECOM. With accelerating infrastructure investment worldwide, our services are in great demand. We invite you to bring your bold ideas and big dreams and become part of a global team of over 50,000 planners, designers, engineers, scientists, digital innovators, program and construction managers and other professionals delivering projects that create a positive and tangible impact around the world. We're one global team driven by our common purpose to deliver a better world. Join us. **Job Description** AECOM has an opening for an experienced Electrical Engineer to be based in Orange, CA; Denver, CO; Columbus, OH or Cleveland, OH. The Electrical Engineer will join a multidisciplinary, collaborative team with a range of expertise supporting the expansion of their knowledge base with the ability to travel and gain field experience. As part of our team, you will support a diverse tapestry of work across markets like Commercial, Federal (Military/DoD), Healthcare, Higher Education, Sports + Rec and Science + Tech markets, including landmark projects in the industry. You will have opportunities to take on complex challenges and pioneer innovative solutions from strategy and design through project realization. Join a practice filled with professionals pioneering Energy Conservation and Zero Carbon initiatives, focusing on renewable energy projects for high-performance buildings. Contribute to decarbonization and electrification efforts while enjoying focused growth opportunities in sustainable practices and skills enhancement training centric to AECOM's Sustainable Legacy. **About Buildings + Places:** Our Buildings + Places practice includes architecture, interiors, building and system engineering, urbanism, and planning (inclusive of landscape design), strategy +, economics, technology solutions, asset advisory, and cost and program management. This diverse team assists our clients from strategy through project realization, creating positive outcomes for those who occupy and use the buildings and environments we help to create. Our practice focuses on the Commercial/Corporate, Science and Technology, Higher Education and Federal market sectors. We look to combine beauty, sustainability, resiliency, equity, and innovation in our projects and believe these values can be instilled in any project regardless of size or budget. **Job Summary/Responsibilities:** The Electrical Engineer will work in a highly collaborative environment on a wide range of projects. The ideal candidate will have a passion for designing building electrical systems. The Engineer will be responsible for performing technical calculations and design, understanding the project requirements and the effort required to complete the work and applying critical thinking to quickly recognize issues and be part of the solution. The responsibilities of this position include, but are not limited to: + Electrical Engineering from conceptual design through construction administration. + Be competent in all aspects of electrical building systems for a variety of types of projects or markets to complete routine engineering assignments and calculations. + Independently perform assignments requiring application of standard techniques, procedures, and criteria to carry out engineering tasks. + Strong understanding of applicable codes and standards relevant to Building related Electrical Engineering to be able to research and apply building code, regulatory and industry code requirements. + Assignments are designed to further develop judgment and understanding of professional and ethical responsibilities. + Exercise judgment limited to developing details of work in making preliminary selections and adaptations of engineering alternatives. + Prepare engineering related calculations and develop drawings and visual aids. + Prepare electrical design calculations, utilize electrical and lighting design software. + Responsible for supporting the electrical engineering design work on assigned projects under the guidance of senior staff. + Coordinating with multiple disciplines and ensuring that projects are delivered within budget and on schedule. + Ensures discipline plans meet overall project team requirements for scope, quality, and schedule. + Stays current on codes and technologies appropriate to electrical, telecom, and security. + Ensures conformance with standards and established design practices, applicable codes, and technical adequacy of design and construction. + Develops designs within a BIM design environment. + Completes assigned engineering and design tasks in accordance with client specified criteria and applicable codes and standards. + Coordinates with other disciplines to produce complete and well-coordinated documents. + Attend meetings with owners, clients or architects as needed. + Organizes and conducts site visits for the purpose of data collection and evaluation of mechanical systems, equipment, components, and materials for projects with and without well-defined scopes **Qualifications** **Minimum Requirements:** + BA/BS in Electrical Engineering, Architectural Engineering or similar +4 years of related experience or demonstrated equivalency of experience and/or education. **Preferred Qualifications:** + Engineer with 6+ years of experience in the design and support of Electrical Engineering work across preferred market sectors such as Commercial/Office, Federal (Military/DoD), Healthcare, Higher Education, Sports + Rec and Science + Tech markets + Possession of Engineer-in-Training (EIT) certification or active progression towards obtaining Professional Engineer (PE) licensure. + Experience with Revit and AutoCAD based design projects + Competent in all conventional aspects of mechanical engineering and conducts work requiring judgment in the independent evaluation, selection and substantial adaptation and modification of standard mechanical engineering techniques, procedures, and criteria + Experience AutoCAD, AGI 32 design software + Excellent communication skills; articulate, assertive, and confident + Creative thinker with effective teamwork skills + Experience with LEED and sustainable design + Strong written and verbal skills with ability to support engineering **Additional Information** + Hybrid work environment – Fully remote position not available. Offered compensation will be based on location and individual qualifications. The expected range is $85,000.00 - $115,000.00. **About AECOM** AECOM is proud to offer comprehensive benefits to meet the diverse needs of our employees. Depending on your employment status, AECOM benefits may include medical, dental, vision, life, AD&D, disability benefits, paid time off, leaves of absences, voluntary benefits, perks, well-being resources, employee assistance program, business travel insurance, service recognition awards, retirement savings plan, and employee stock purchase plan. AECOM is the world’s trusted infrastructure consulting firm, delivering professional services throughout the project lifecycle – from advisory, planning, design and engineering to program and construction management. On projects spanning transportation, buildings, water, new energy and the environment, our public- and private-sector clients trust us to solve their most complex challenges. Our teams are driven by a common purpose to deliver a better world through our unrivaled technical and digital expertise, a culture of equity, diversity and inclusion, and a commitment to environmental, social and governance priorities. AECOM is a Fortune 500 firm and its Professional Services business had revenue of $14.4 billion in fiscal year 2023. See how we are delivering sustainable legacies for generations to come at aecom.com and @AECOM. **Freedom to Grow in a World of Opportunity** You will have the flexibility you need to do your best work with hybrid work options. Whether you’re working from an AECOM office, remote location or at a client site, you will be working in a dynamic environment where your integrity, entrepreneurial spirit and pioneering mindset are championed. You will help us foster a safe and respectful workplace, where we invite everyone to bring their whole selves to work using their unique talents, backgrounds and expertise to create transformational outcomes for our clients. AECOM provides a wide array of compensation, benefits and well-being programs to meet the diverse needs of our employees and their families. We’re the world’s trusted global infrastructure firm, and we’re in this together – your growth and success are ours too. Join us, and you’ll get all the benefits of being a part of a global, publicly traded firm – access to industry-leading technology and thinking and transformational work with big impact and work flexibility. As an Equal Opportunity Employer, we believe in each person’s potential, and we’ll help you reach yours. All your information will be kept confidential according to EEO guidelines. **ReqID:** J10124279 **Business Line:** B&P - Buildings & Places **Business Group:** DCS **Strategic Business Unit:** West **Career Area:** Engineering **Work Location Model:** Hybrid **Legal Entity:** AECOM Technical Services Inc"
    }
]